{"meta":{"title":"flechazo","subtitle":null,"description":"我在人间凑数的日子","author":"flechazo","url":""},"pages":[{"title":"categories","date":"2020-03-09T05:50:05.000Z","updated":"2021-03-23T10:20:38.059Z","comments":true,"path":"categories/index.html","permalink":"/categories/index.html","excerpt":"","text":""},{"title":"about","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-21T06:14:04.994Z","comments":false,"path":"about/index.html","permalink":"/about/index.html","excerpt":"","text":"[さくらのflechazo] 与&nbsp; Mashiro&nbsp; （ 真（ま）白（しろ） ） 对话中... bot_ui_ini()","keywords":"关于"},{"title":"comment","date":"2018-12-20T15:13:48.000Z","updated":"2020-03-16T10:41:30.000Z","comments":true,"path":"comment/index.html","permalink":"/comment/index.html","excerpt":"","text":"念两句诗 叙别梦、扬州一觉。 【宋代】吴文英《夜游宫·人去西楼雁杳》","keywords":"留言板"},{"title":"bangumi","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-30T11:29:04.286Z","comments":false,"path":"bangumi/index.html","permalink":"/bangumi/index.html","excerpt":"","text":"","keywords":null},{"title":"lab","date":"2019-01-05T13:47:59.000Z","updated":"2020-03-16T10:41:30.000Z","comments":false,"path":"lab/index.html","permalink":"/lab/index.html","excerpt":"","text":"sakura主题balabala","keywords":"Lab实验室"},{"title":"music","date":"2018-12-20T15:14:28.000Z","updated":"2021-03-21T07:44:12.190Z","comments":false,"path":"music/index.html","permalink":"/music/index.html","excerpt":"","text":"","keywords":"喜欢的音乐"},{"title":"donate","date":"2018-12-20T15:13:05.000Z","updated":"2020-03-16T10:41:30.000Z","comments":false,"path":"donate/index.html","permalink":"/donate/index.html","excerpt":"","text":"","keywords":"谢谢饲主了喵~"},{"title":"theme-sakura","date":"2019-01-04T14:53:25.000Z","updated":"2020-03-16T10:41:30.000Z","comments":false,"path":"theme-sakura/index.html","permalink":"/theme-sakura/index.html","excerpt":"","text":"Hexo主题Sakura修改自WordPress主题Sakura，感谢原作者Mashiro","keywords":"Hexo 主题 Sakura 🌸"},{"title":"tags","date":"2020-07-18T05:50:05.000Z","updated":"2021-03-20T02:08:56.282Z","comments":true,"path":"tags/index.html","permalink":"/tags/index.html","excerpt":"","text":""},{"title":"links","date":"2018-12-19T15:11:06.000Z","updated":"2020-03-16T10:41:30.000Z","comments":true,"path":"links/index.html","permalink":"/links/index.html","excerpt":"","text":"","keywords":"友人帐"}],"posts":[{"title":"⛄Python爬虫☃","slug":"Python爬虫","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-30T11:50:54.324Z","comments":true,"path":"2021/03/21/Python爬虫/","link":"","permalink":"/2021/03/21/Python爬虫/","excerpt":"","text":"导入模块： from selenium import webdriver from selenium.common.exceptions import NoSuchElementException 选择浏览器：driver = webdriver.Firefox() 打开url:driver.get(“http://www.baidu.com&quot;) 等待： driver.implicitly_wait(30) driver.set_page_load_timeout(30) driver.set_script_timeout(30) 关闭浏览器：driver.quit()/driver.close() 前进/后退：driver.forward()/driver.back() 在这里向大家推荐一个学习交流群：672899761 刷新：driver.refresh() 返回当前页面标题：driver.title 返回当前页面url：driver.current_url 返回当前浏览器的所有窗口：driver.window_handles 返回当前浏览器的窗口句柄：driver.current_window_handle 选择窗口：driver.switch_to_window(“window_name”) 对话框操作：driver.switch_to_alert() #选择窗口对象 accept() #点击确认 dismiss() #点击取消 text #获取文本值 send_keys(“key”) #输入值 元素定位 定位元素（单个）：driver.find_element(by=”id”,value=None) Id定位： driver.find_element_by_id(“id_name”) Name定位：driver.find_element_by_name(“name”) Css定位： driver.find_element_by_css_selector(“#foo”) Xpath定位：driver.find_element_by_xpath(“//select[@id=’nr’]/option[2]”) Link定位：driver.find_element_by_link_text(u”链接”) Tag定位： driver.find_element_by_tag_name(“foo”) 截取当前页面： driver.get_screenshot_as_file(‘/Screenshots/foo.png’) 发布于 2021-03-23","categories":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}],"tags":[{"name":"web","slug":"web","permalink":"/tags/web/"}],"keywords":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}]},{"title":"⛄人生感悟☃","slug":"人生感悟","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T02:08:15.610Z","comments":true,"path":"2021/03/21/人生感悟/","link":"","permalink":"/2021/03/21/人生感悟/","excerpt":"","text":"1，乔布斯说：我特别喜欢和聪明人交往，因为不用考虑他们的尊严。 采访者问：聪明人没有尊严吗？ 乔布斯补充道： 不，聪明人更关注自己的成长，时刻保持开放的心态，而不是捍卫’面子’， 不是想方设法证明’我没错’。 2. 直到一个作者问晚年的佛洛伊徳，心理学的始祖：老师，你能不能够总结一下这50年研究心理学的经验？能不能一句话告诉我对人最重要的是什么？ 佛洛伊徳只有两句话：“去爱！去工作！” 3. Not everyone thinks the way you think, knows the things you know, believes the things you believe, nor acts the way you would act. Remember this and you will go a long way in getting along with people. 4. 最近我渐渐把“这件事情为什么要发生在我身上？”的想法替换成“这件事情是想教会我什么？”然后发现身边的一切都变了。 阿毛我来翻译翻译：跟我争论等于不聪明。单单乔布斯说：我特别喜欢和聪明人交往，因为不用考虑他们的尊严。采访者问：聪明人没有尊严吗？乔布斯补充道：不，聪明人更关注自己的成长，时刻保持开放的心态，而不是捍卫’面子’，不是想方设法证明’我没错’。没有“面子”，你会被吃掉的。 5. 一个心理学实验：一批志愿者，告诉他们体验歧视，在他们的脸上做出疤痕，然后让他们分散在每个公共场所，晚上回来的时候让他们讲体验。很多人都说自己遭受歧视了，而事实上，他们在出去的时候工作人员以补妆为借口已经把他们的疤痕擦去了。对外界的焦虑，来自自己对自己的看法，对自己的看法会篡改你在外界收到的真实信息。我们焦虑与人际，大多是觉得自己不够好，不够优秀，其实别人压根没觉得你应该优秀。","categories":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}],"tags":[{"name":"感悟","slug":"感悟","permalink":"/tags/感悟/"}],"keywords":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}]},{"title":"⛄图库☃","slug":"图库","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T11:46:04.068Z","comments":true,"path":"2021/03/21/图库/","link":"","permalink":"/2021/03/21/图库/","excerpt":"","text":"","categories":[{"name":"图库","slug":"图库","permalink":"/categories/图库/"}],"tags":[{"name":"图集","slug":"图集","permalink":"/tags/图集/"}],"keywords":[{"name":"图库","slug":"图库","permalink":"/categories/图库/"}]},{"title":"⛄你有哪些屡试不爽的话术？☃","slug":"你有哪些屡试不爽的话术？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:45:04.632Z","comments":true,"path":"2021/03/21/你有哪些屡试不爽的话术？/","link":"","permalink":"/2021/03/21/你有哪些屡试不爽的话术？/","excerpt":"","text":"别人求你办事，如果你说：“这事儿不太好办”，那么资源置换就来了。不好办说明能办，但需要附加条件，懂的人自然知道接下来应该怎么办。2、拒绝借钱：“你知道的，我最近XX，也没钱。”遇到借钱，只要你平时不太露富，就好用。朋友管你借钱，用“你知道的”直接把皮球踢回去，再给个具体理由，比如买了什么东西、投入基金股票里了，随便什么都行。只要把对方放在知道你没钱的位置上，他就不好再开下一句口，一般会主动结束对话。3、表示体贴，但不想真的去接客户，先打电话沟通：“约的地方有点远，需要我去接您吗？”绝大部分人遇到这样的问句，本能反应是不用，你的目的就达到了。不过如果真遇到要你接的，这人多半有点矫情，以后相处要注意多恭维一下。4、经典汇报话术1：“老板，我们团队做了A、B两版方案，各有优势，您给提提意见，看选哪个好。”该话术利用了沉锚效应，抛出了二者选其一的锚，避开全部拒绝的选项，引导领导“选一个”、“提意见”，减小被全部驳回的风险。5、经典汇报话术2：“领导，我是这么想的，XXX。第一，X；第二，X；第三，X。”我们的大脑被训练得听到“第一、第二”就默认为其中有条理、有逻辑，不管其中是不是真的严丝合缝地支撑你的观点。善用一二三做汇报，领导会觉得你准备得很充分，考虑周全。6、遇到问题请求领导帮忙：“经过了解，现在碰到了一些情况，我的解决办法是XX，您看还有没有什么更好的办法。”不要直接说自己解决不了，让领导想办法。不管自己提出的办法多平庸，都一定要提。7、请求他人帮忙：“能请你帮我打印一下文件吗，因为我一会儿真有事。”、“不好意思，能插一下队吗，因为我真的着急。”善用“因为所以”，“因为所以”是十几年语文教学留给我们的条件反射，不管多离奇的理由，听到的时候都会默认有道理。8、聊天想聊下去：揪住对方句子里的关键词+延伸过往彼此交流过的信息。例1朋友：“今天又加班，烦死了。” 你：“怎么又加班啊，又是上回让你加班的那个领导吗？”例2闺蜜：“我爱豆塌房子了！”你：“哪个爱豆？上回你说的XXX？我去！”9、聊天不想继续聊下去：重复关键词+感叹词。重点！不要扩展任何有效信息。例1朋友：“今天又加班，烦死了”你：“怎么又加班啊，唉，这叫啥事啊，我无语。”例2闺蜜：“我爱豆又塌房子了！”你：“又塌房子！我去，也太那个了，绝了！”10、领导说：“辛苦了。”你：“从中学到很多，很有收获。”敏而好学、不居功，领导更喜欢这样的下属。11、给领导的节日问候：尊称+感谢+互动+祝福尊称放在前面，引起注意。互动要具体、细节，才有记忆点。XX，过年好！感谢您一直的关照，从您身上学到很多。上次XX，您说XXX我一直记得，受益匪浅。又到新的一年，祝您和家人新年快乐！12、改变一个人的想法：认同立场，替换观点。无论任何人，观点不是不可改变的，但立场很难动摇。比如你的预算交上去，被砍了很大一块，你能做的不是抱怨老板抠门，而是认同老板砍预算是为了控制成本，开公司是为了赚钱的，这就是老板该有的立场。所以，如果你不想自己的预算被砍掉，只有你能向老板展示，你做的方案能为他赚更多钱，老板就不会不同意。","categories":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}]},{"title":"⛄你有哪些屡试不爽的经典话术？☃","slug":"你有哪些屡试不爽的经典话术？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:41:25.858Z","comments":true,"path":"2021/03/21/你有哪些屡试不爽的经典话术？/","link":"","permalink":"/2021/03/21/你有哪些屡试不爽的经典话术？/","excerpt":"","text":"1、 如果被推出去做临时发言，没有时间准备稿子，时间线就是最好用的逻辑线。大学里的社团聚会，工作中团建，总有那么一次，会轮到你说点什么。急急忙忙、慌慌张张、东扯西扯，扯不出个所以然来，那你不仅不会有下次表现的机会，自身形象也会大打折扣。遇到这种情况，根本用不着慌，“①以前的经历…②现在的体会…③以后的希冀…”这一套模板下来，整个发言清晰又深刻。比如在大学毕业晚会你被忽然推上台：以前总觉得大学的日子还长，从来没有好好想过自己以后要做点什么，也没有好好珍惜周围的人，今天站在这里才发现，四年是一段非常短暂的时光，一转眼就走到了我们要说再见的时候，我觉得特别幸运加入这个大家庭，希望以后，就算我们毕业了，也能像今天这样，坐在一起吃饭、喝酒、侃大山。像这样完全不需要动脑子，拿到就能用的话术妙招，接下来我还会教你几招，让你在那些需要好好说话的情况下，一秒高情商。其实我知道这么多，都是从大学毕业到工作这两年，看了上百个演讲视频，这些视频里演说家跟人互动、讲述方法、表达情感的说话技巧教会了我很多，也给了我再次跟人主动交流的自信，让我从一个开口老得罪人的低情商，变成了一个在镜头前也完全不怯场的博主。我把对我影响巨大的演讲视频都整理了一份，关注我的公众号【Toly】，回复「TED」可以一起分享这些，更多表达技巧、思维干货等你来发掘。2、 道歉是件非常严肃的事情，想取得原谅，「①就后果道歉+②紧急处理+③下次预防措施」这三个方面一个都不能少。先看看你们自己道歉时的嘴脸，这有用才怪了。“我错了嘛，对不起还不行嘛，我都这样道歉了你就原谅我呗” “哎呀我不就是用了你一点东西嘛，这有什么啊，我的也给你用行了吧” “我承认我刚刚跟你发脾气不对，但是你之前也大声吼我啊，我都没有说什么，我们抵消可以吧？”道歉是因为你闯了祸，搞出了事情，你得为这事负责，你硬气啥呢？比如我自己吧，前两天在自己的公众号【Toly】上转载了别人的一篇文章，事先经过了对方的同意，也标记了转载。但是，因为微信公众号的转载标记不够显眼，很多读者误以为是对方抄袭了我的文章，就跑去对方评论区骂人家，说对方抄袭。我发现以后十分自责，深知这场乌龙一定会搞得那位大佬特别不爽，于是立刻给对方打电话道歉，我说：①杨老师，昨天转载您的推文，来源标记不够显眼，导致读者误会，给您带来困扰，我非常抱歉。②我已经公开给所有读者做了解释，并且删除了这篇文章，希望不会给您带来持续的麻烦。③另外，我做了一个转载模板，发您看一眼，您觉得下一次如果再转载，这样的标记可以吗？对方听了说，没事没事，哎呀这点小事，不用这么在意。但你记住了，不管多大的事，不管人家说在意不在意，你都得把场面做全了。3、用第三人的嘴夸对方，才能夸到人家心坎上去。舍友买了一件新衣服，你说真帅，同事拿奖金了你说真厉害，亲戚买房了你说真有钱。牛x，厉害，真棒，真好，秀啊。。。其实，这些话人家都听腻了，你夸跟没夸一样。真正牛X的夸法，是通过第三方无意间的赞美。比如你舍友今天化了一个特别满意的妆，你得这么说哎，我社团一男生说刚刚看见咱俩了，说你真好看，让我下次社团聚餐带上你这个大美女呢这是什么感觉啊美女们，直接飘了好吧？还有，以后你们上对象家里去，对着人妈妈要这么夸阿姨，我给我妈看了您照片，我妈说您保养的这么好这么年轻，她羡慕死了你信不信，你阿姨除了高兴得合不拢嘴，还会积极给你妈分享保养秘诀。4. 不管要请谁帮忙，一定要说明白这件事对他的好处。一件事情别人之所以坐视不管，不是因为事情本身不重要，而是因为没有触及到他的利益。不管是领导、客户还是女朋友，想说动人家给你办事，你多困难多辛苦不是重点，重点是人家能拿多少好处。就如同我跟别人说，我自己的回答写的多牛掰，我有多少干货，别人都不会搭理我。但是我如果说，点赞的人会暴富，你看多少人给我点赞。我见过一个粉丝不是很多的博主，去见广告商，就说了下面这一段话，几万块的广告费就拿下了。我知道您这边不缺账号资源，但是呢，我的账号有三个优势： 1. 我跟很多品牌方合作过，粉丝也对此类产品很友好，所以有助于您增加品牌效力。 2. 我的粉丝群体购买力强，您的转化效果不会差。 3. 我图的都是长久的合作，所以如果您这边效果不好，我可以免费再做一次推广，不会让您的业绩指标在我这里拉垮。看似简单而体面的一段话背后，其实是见识、视野、思维的支撑，需要大量的阅读积累。当然，读书的过程中一定要注意选择书目，因为现在的书良莠不齐，很多不过是为了营销而写的烂书。如果你手里没有一份优质的书单，没有关系，我总结了豆瓣评分很nice的书单。这些书都是我做读书博主以来，感受最深、最长见识的好书，让我从一个懵懵懂懂的社会小白，成长为独当一面的自媒体创作者。来我的公众号【Toly】回复「书单」，我把这些好书也分享给你，我们一起变优秀。5、拒绝别人的时候，提一个替代解决方案，就不会得罪人了。比如舍友让你帮她做个表格，你可以说“我还有个大作业没做，马上要交了。这样吧，你有什么操作上的问题可以问我。”比如同事让开车的你顺便送她，你可以说“我和朋友约了饭，要不我把你带到最近的公交站？”拒绝的理由一定要不可坑，替代方案一定要具体，这样他既不能继续追着提要求，又得到了解决方法，怨不了你。告诉你这么好用的绝招，那你给我点个赞不过分吧。6、追女神/男神的时候，要有“上台阶”的意识。循序渐进、步步为营、皮中带稳。第一次，就找女神搭个话，能回应你就行；第二次，尝试着约个饭，别动手动脚；第三次，请女神看电影，磨蹭到宿舍关门，再跟女神表白。你别一上来就请女神看电影开房，那人家肯定骂你流氓啊。把「在一起」这件事，拆分地细一点，具体一点，这样对方才能跟着你循序渐进，最后完成本垒打就是件自然而然的事情了。7、 抓住核心冲突，就能讲好一个生动有趣的故事。别说讲故事了，很多人连个八卦都讲不好。“哎你们知道吗，咱们系花跟计算机学院一学霸好上了，虽然是系花插足，但是现在天天秀恩爱呢，太酸了”这个八卦，明明这么劲爆这么刺激，怎么你说起来就这么索然无味呢？因为你没抓住这个故事的核心冲突啊。这个故事最刺激的地方是什么？是系花和学霸的爱情吗？不是，是系花第三者上位啊。这个故事正确的打开方式应该是这样的：“咱们系花，就是那个风华绝代、颜值爆表、大腿一米五的女神，不知道被多少人追，就副校长看了她都流哈喇子，两眼青光、浑身抽搐，结果你们猜怎么着？ 人家全都看不上！人家看上了计算机系一学霸、那学霸，满脸坑包、浑身爆皮、两眼呆滞，身高目测也就1米49，能从女神胯下直接走过去。而且，这学霸还有一村姑女友，系花那是明知山有虎、偏向虎山行，半夜给学霸打电话，那小话，撩得学霸不行不行的。 据说有一天直接就穿超短裙坐在学霸大腿上请教数学题，这一下子就硬，硬是给学霸抢走了，唉，果然美女做什么都容易成，现在俩人还天天搁朋友圈秀恩爱呢”越是女神，小三上位这个冲突点就越爆，所以要为冲突点做好铺垫，然后等冲突爆发的时候，再加那么一两句感慨，点破这个故事揭示的问题。那你这个故事讲的，绝对是太勾人了。8、演讲的时候，不要一上来就煽情，low炸了。“大家好，我叫Toly，我今天演讲的主题是理想。理想，就是人生的一道光，就是…”直接煽情是最没用的共鸣方式。就像上面这样。煽情的话，只有在一定的语境和氛围里，才能打动观众。演讲一开始，你和台下的观众还很陌生，他们不知道为什么你要讲理想，他们自己都没理想，根本体会不了那种情感。所以厉害的演说家，都会在演讲之前，先跟观众互动，开个玩笑，或者讲一下演播厅里的趣事，拉近跟观众的距离。然后再慢慢叙说自己的故事，把观众代入到他的情境里。这样的演讲，才能激发观众的情感共鸣。全世界最有名的演说家们都在TED里边，你看他们演讲的时候语言就很幽默很放松，观众愿意信任他。要是你还不知道好的演讲是什么样，那我劝你多看看TED，这些大牛不仅在他们的专业领域是佼佼者，在公开场合的表达能力也是全世界最优秀的，跟他们学习演讲技巧，以后那些公开发言的场合，完全能轻松hold住。需要TED视频的，可以关注我的公众号【Toly】，回复「TED」，我们一起学习。9、 教你一套打嘴炮的必赢话术他跟你讲普遍，你就跟他讲个例；他跟你讲现实，你就跟他讲情怀；他跟你讲实然，你就跟他讲应然；他跟你讲事实，你就跟他讲观点；他跟你讲逻辑，你就跟他讲情绪；他跟你讲数据，你就跟他讲故事；无敌。10、 面对实力比你弱很多的对手，做好一个“捧哏”，比臭显摆高级多了。奇葩说7开播第一期，来了一个北大女状元，对杨幂说“我今天想讲的话题是内卷，哦，为了照顾康永老师（台北）和杨幂老师，我解释一下什么叫内卷”最后，这个女状元说的内容没有什么有趣的经历，也没有什么新颖的观点，0票淘汰。可能你很有口才你也有见识，甚至你就是某个领域的牛人，张口闭口就是“其实这个点你说得不全面，是这样的…”但你要知道，你永远不可能穷尽这个世界上所有的知识，你遇到的每个人，都有比你厉害的地方。如果你能把话改成“你说的这个点挺有意思的，给我讲讲好吗？”那么，哪怕你对面是个一无所知的小孩子，也会愿意跟你分享他眼中的世界。11、 一点点小小的收获，也不要忘记感谢给你带来收获的人。就像这篇回答，如果能让你某些场合更从容的开口说话，那么就点击左下角给我一个赞吧。","categories":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"人生感悟","slug":"人生感悟","permalink":"/categories/人生感悟/"}]},{"title":"⛄你知道哪些网抑云经典语录？☃","slug":"你知道哪些网抑云经典语录？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:10:35.133Z","comments":true,"path":"2021/03/21/你知道哪些网抑云经典语录？/","link":"","permalink":"/2021/03/21/你知道哪些网抑云经典语录？/","excerpt":"","text":"1、有个卖婚纱的婆婆说:“卖了这么多年的婚纱，从未见过有哪个男孩，在帘子拉开时会发出“哇”的惊叹。”后来过了这么多年才明白，大概是他们都没能留住年少时的爱人吧。试婚纱的姑娘或许也曾在试衣间里流过眼泪，她也没能嫁给17岁时年少的喜欢。《你的姑娘》2、我睡了一下午，醒的时候屋子里黑漆漆，一点声音都没有，抬头望了望窗外，天还没没完全黑，四处摸了摸，在枕头下找到手机，开机后屏幕亮起，干净，没有一条信息。《打回原形》3、“可以做朋友吗？”这是故事的开始。“还可以做朋友吗？”这是故事的结尾。《可乐》4、“什么时候最孤独？”“一个人放烟花，万人欣赏”“？”“盛世烟火有你而放，他们都在看烟花，无人想起你。”《高米店南》5、“李白写过那么多诗，他自己会背吗？”“像李白那么不羁的人，估计写完就忘，放不下的是我们俗人自己。”《醉诗仙》6、我真的有在好好的按着你喜欢的样子来拜托你不要不喜欢我《关键词》7、曾经有人问我，失去的东西回来还要吗？我说，曾经丢了一粒扣子，等到找回那粒扣子我已经换了衣服。《放过自己》8、感觉……就像是一位剑客喝醉了，拎着个破酒壶，走得跌跌撞撞，但大有独步天涯的气势，路人皆避他为疯子。《空城计》9、有些人很奇怪，不爱你还不放过你；有些人更奇怪，爱你还不放过你。《有一种悲伤》10、我爷爷有一次偷偷告诉我说，每次当奶奶生他的气了，他就会把家里所有的酱料罐 泡菜罐的盖子拧得紧紧的，这样奶奶就会跟他说话了，感觉太可爱了。《足够》11、道歉不一定代表我错了，只是我认为这段关系比我的尊严还重要。《我曾》12、其实真正杀我的，从来都不是分手那一刻的狠话，而是平静下来的某一刻， 我突然想到与你有关的零碎，那是凌迟。《出卖》 ​13、那些说“忘了我”“分手吧”是世界上最残酷的三个字的人真是太没见过世面了，你们是没听说过“快起床”这三个字。《满足》 ​​​14、怎么会不遗憾你还没见过他单膝下跪求婚的样子为你做饭的样子为你和儿女赚钱养家的样子老了还爱你的样子《谁》15、一个人离开你的时候，不要问原因，你能想到的所有理由，都是对的。《第三人称》16、考59分比考零分更难过，最痛苦的不是不曾拥有，而是差一点就可以。《淘汰》17、我不得不承认，曾经有那么一刻，我以为我们能在一起一辈子，我放下了所有骄傲，迁就了你的一切，可还是没能走到最后，只因为我们生活的年代不是牵了手就能一辈子的。《相见恨晚》18、见到你那一刻我心里有场海啸，可我静静站着，没有让任何人知道。《兴奋剂》19、还是老妈说的话最经典，她说：“你们这代人呐，就是活的太明白了，所以什么都得不到。我们当年什么都糊里糊涂，该结婚结婚，该工作工作，现在什么都有。”《一万次悲伤》20、没有正确的三观没有成熟稳重的性格没有独立的经济条件做点皮毛就说爱你的人这不叫爱，这叫耽误。《FUN》21、洗澡要放歌，厕所带手机，睡觉要侧面，坐车要靠窗。《孤身》22、放不下的时候，多想想对方是怎么放下你的。《洋葱》23、“你剥开一只很酸的橘子而感到后悔了，但对于橘子来说，那是它的一切。”《追光者》24、不应该太心软，死不放手的样子是挺丑，我知道。《小半》25、人一旦矫情起来，就会觉得所有的歌都是在说自己的故事。《一万次悲伤》26、成年人最体面的告别方式大概就是我的最后一条消息你没有回而我也默契的没有再发从此我们互为过客《遇见》 ​27、小时候词不达意，总想长大了好好说。等长大了，却总是言不由衷。《你瞒我瞒》28、数学里有一个最美的词叫求和数学里有一个最绝望的词叫无解《如果》29、刚才我爸说了一句很厉害的话，我保存一下。“十五岁的时候我跟你一样追赶流行，但五十岁我开始热爱俗气的一切。你觉得是我老了吗？不，我只是一如既往的热爱十五岁时喜欢上的东西。”《Shell Shocked》30、“你怎么把生活过成现在这个样子的？”“正常发挥啊”“那以后怎么办？”“熬”《熬》31、偶尔在没人的路上像小时候一样蹦蹦跳跳地走路，突然路口窜出一个人又赶忙正经起来。《遇见你时所有星星都落到我头上》32、小时候不理解老人晒太阳，一坐就是半天。长大了才明白，目之所及皆是回忆，心之所想皆是过往，眼之所看皆是遗憾。《红莓花儿开》33、愿你六月考出超常成绩七月被理想学校录取八月使劲吃睡玩九月和喜欢的人读一所学校《看到风》34、“ 他为你擦泪和舍不得你哭是两码事。”《舍不得》35、一位美国士兵迟到了五分钟，教官罚他站了2小时。罚站完后，教官问他：“你为什么迟到了？”士兵回答了一声：“我起晚了。”教官听了，生气的说了一声：“如果全世界的士兵都像你这样，那会怎么样？”士兵淡淡的回答了一句：“那世界将会没有战争。”","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄工作经验☃","slug":"工作经验","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T02:12:25.839Z","comments":true,"path":"2021/03/21/工作经验/","link":"","permalink":"/2021/03/21/工作经验/","excerpt":"","text":"每天 24 小时，多半时间都跟工作有关。 如果不能以一个好的心态面对工作，生活必将是一场折磨。 公司的资源，永远都是有限的。 会哭的孩子有奶吃，要敢于向公司索取资源，要学会争取领导和同事的支持，别只想做老好人，要想着做成事。 不断把小事干好，老板就会交给你更重要的事。 抱歉，真实的职场并不总是这样。每个公司都有一堆小事、琐事，这些总得有人干，如果你长期满足于做这些，你可能就会一直做这些。主动地、不断地去为自己争取更重要的事情做。先完成，再完美！ 没有稳定的工作，只有稳定的能力增长。 创业公司、大企业、国企、央企、外企、事业单位、政府部门，都不稳定。 学会服从和执行。 很多时候，不是领导想不到你能想到的点子，而是很多时候点子真的没那么值钱，你要明白「想做」、「能做」、「可以做」这三者的不同。 有功，就要学会邀功。 辛辛苦苦工作了一年，结果年终汇报你草草了事，其实是在坑自己。不要以为你做的，老板都看在眼里，老板可没那么闲，尤其是在大公司。 面子不值钱，尤其是你的面子，尤其是你能力不够的时候。 很多前辈告诉我们，公司的工作，不分你的我的，你部门的我部门的，多去做就能收获更好的成长，尤其是在创业公司。 这话没错，但有前提，就是你首先把份内的工作做得很好了，再去帮其他人分担。否则你不光傻，还添乱。 没有企图心的人，不会有很大的上升空间。 但切忌把企图心写在脸上、挂在嘴上。 在公司里，再自私自利的目的，你也要学会用高大上的套话包装一下，别管大家信不信，别把愚蠢当真诚。 做得好，不一定被提拔。 要学会主动展示自己，先要让自己被看见，然后才能被认可，不能坐等机会，要主动争取机会。 进入一个团队，别人没有义务融入你的体系，但你有义务主动了解同事、融入团队。 越快融入团队，对你开展工作越有利，前三个月是关键。 多跟同事一起吃饭，多参加集体活动。 组织成员间高频的非正式沟通很重要，聊聊家常、喜欢什么运动、最近在追什么剧、有什么新鲜事，这些话题能让大家在轻松的氛围中更立体的了解彼此，提高每个成员的融入感。 不管你在哪家公司，最好要知道，谁决定你的去留，谁决定你的薪水，谁给你做绩效考核。 工作是领导分配的，但能力是长在自己身上的。 不要以完成任务的标准工作，而是以长本事和涨知识的心态工作，这样你会发现，你是在领着工资学习，不仅成长更快，而且更开心。 重要会议、团队活动别迟到。 若迟到，道歉时请诚恳一点。少道歉，再诚恳的道歉，多了也会失效。 不随便承诺，承诺了一定做到。 做不到、完不成，要提前沟通，谨防个人信用破产。 工资本质上是自己给自己定的。 放在整个市场上看，放在稍微长一点的周期里看，别纠结几个月的不公，别纠结一家公司的判断。少关注工资，多关注成长，工资自然越赚越多。 哪怕你离职是因为和同事吵翻了，写辞职信时也要说是因为搬家了才换工作，人要学会给自己留后路。 别在公司树敌，别得罪同行。 世界很小，行业和圈子更小，三十年河东三十年河西。不管是和公司内部成员还是外部伙伴共事，都要注重个人声誉，至少不要留下坏名声。 职业尊严就是，至少把自己手里的活儿做漂亮，不给团队拖后腿，不给同事添麻烦。 每个人都想做自己喜欢又擅长的工作。 但如果你暂时没找到喜欢的，可以尝试先逼自己把手头的工作做到擅长，因为大部分人都会喜欢做自己擅长的事。 除了喜欢和擅长，你还应该学会看行业大势。 看你要去的公司在行业中的位置，看你应聘的岗位在公司中的位置，看你将要和怎样的人一起工作。所谓选择大于能力，是因为会做选择本身就是一项重要能力。 工作中的沟通和人际关系处理，要牢记对事不对人。 首先，面对别人时要不断提醒自己做到；其次，你以为别人针对你时，要告诉自己，对方针对的不是你而是事。 与同事沟通，重要议题做决定后，最好用文字呈现后再次同步给其它成员。 一方面是备份，更重要的是强化各方达成的共识。 不懂就问，有时是招人烦。网上动动手指就能搜到答案的小白问题，别轻易麻烦别人，尊重对方的时间。 别越级汇报和越级指令，尤其在大公司。 若做了，及时让中间层级的人知情。 在大公司工作，要加强书面沟通能力；在小公司工作，要加强面对面的沟通能力。 性格外向爱说话和擅长沟通，不是一回事。 简单的事，学会在 30 秒内说清楚；复杂的事，沟通前演练一遍，哪怕是在心里演练；不能完全自信，就先在手机便签上写一写，列一下 1 2 3。 主动汇报工作进度。 主动汇报进度 &gt; 完成后及时汇报 &gt; 结果不好 &gt; 不汇报。每次别人不问你不说，做得再好也会减分。 团队协作时，乐于被领导也是一种能力。 在一个协作流程中，学会主动伸手和上下游对接；给别人出选择题，而不是问答题，尤其面对上级时。 保持练习写作能力。 能想明白、写清楚的人越来越少，眼高手低的人越来越多。不管你在哪个领域、做什么工作，会写东西永远都是一个加分项，写作本身也是一个思维训练的过程。 不要挥霍你的职场人脉。 群发求点赞，红包求转发，未提前说明拉人进群，未征求对方同意把微信推给别人，无节制的请同事帮忙，等等，都是在挥霍自己宝贵的人脉。 做过领导，你才知道当领导有多难。 做员工时，你觉得领导是孙子。做领导后你会发现，爷爷更多了，上面有爷爷，下面也有爷爷，越是中层，越难做。 管理好自己的情绪，别发火，别生气，别撕逼，别抱怨。家庭的压力、生活的压力，不要发泄在职场中。 职场中产生负面情绪，也别带回家，别释放给家人。 任何一个团队，都不欢迎负能量传播者。 负能量的传染能力要远高于正能量。人人都有负能量，但聪明人不会展现出来。 团队共事过程中，尽量少做负面表达。 怀疑、质疑、暗讽、指责、抱怨、牢骚，都是给你无限减分的负面表达。只会提反对意见的人，真的招人烦。提反对意见时，你最好有更好的建议，提问题最好也备着解决方案。 你的表现都至少要职业。 职业就是，尽可能少的在公司主动展示私人情感、情绪、欲望、喜好等，这方面，别把公司当成自己家。尤其是在大公司。 没有人真的不可替代，别把自己想得太重要。 不要觉得自己重要到老板离不开你，很多人都有这样的幻觉。BAT 的高管每年换多少，那些人个个都是人精，但少了谁太阳也照常升起。 要努力工作，但要少谈论自己的努力，多让业绩替你说话。 努力工作，老板可能会感动，但感动和给你升职加薪是两码事。 如果你做出成绩了，老板只夸你不给你奖金，这是老板耍流氓。 如果你没业绩，想用努力感动老板、升职加薪，那是你耍流氓。 有时候选择是比努力重要。 但你在小白阶段的时候，是没有多少选择的。你需要从可选择的几个选项里做出最优选择，剩下的就是拼命努力，让自己在接下来有更多的选择。 职场早期，作为下属，一定别太计较干多干少。 干的越多，学的越多，在公司的口碑越好。领导说不说，都是看在眼里的，没人会喜欢太过计较的人。 职场上，多跟比自己更优秀的人交往。 工作上，多做更难且对的事。 别以为自己还年轻，就不着急努力。 毕业 3 年后，你还没建立起核心竞争力，可能以后想努力都没机会，那些精力比你更旺盛、薪水要求却远没你高的应届生会把你碾压。 没有人不迷茫。 你迷茫、焦虑，别怕，大家都这样，年薪百万的人更迷茫。迷茫就多问，多搜索答案，多告诉自己这是正常的，然后及时调整。 别给自己设限。 经常有人在后台问我，「我已经做 XXX 3 年了，现在转行去做 XXX 还来得及么？」，一问对方，才 26 岁。为什么 30 岁还没到，就觉得人生定型了？明明人生才刚开始，别什么都不敢尝试。 最怕的不是死工资，而是心死了。 很多人大学毕业时，一腔热血充满激情，相信自己相信未来。但进入社会两三年后，亲身体会了现实和理想的差距，就慢慢的认命了，这才是最可怕的。 你 25 岁，还很年轻，你 30 岁，还很年轻，你 35 岁，也还年轻，不要在年纪轻轻的时候认命，这是最重要的。只要不认命，就还有机会。 职场早期，你更应该相信长板理论。 尽可能放大你的优势，比拼命去补你的劣势更重要。积累自己的不可替代性，而不是成为一个什么都会的平庸者。 永远别嘲笑努力，持续努力本身就是一种能力，80% 的人都没有这种能力。 方法、选择、努力都很重要。 别一味把「选择大于努力，方法大于努力」挂在嘴上，争取更好的选择、研究更好的方法，本身就需要比别人更努力。选择和方法，不是天上掉下来的。 自己风光时，别笑话别人。 这个世界的变化速度，超过大多数人的反应速度，你风光无限的行业随时可能被颠覆，你积累的经验可能随时变得一文不值。 注重个人形象。 大裤衩、背心、拖鞋、低胸装、超短裙、杀马特发型、贴亮片镶着钻的指甲出现在办公室里，都不够体面，除非你们公司文化就是这样。 也别老觉得领导是傻逼。 他能做你的领导，一定有比你强的地方，去学习。 自己做领导，尽量别跟下属私下太过亲近。 否则下属犯错、出现管理问题时，你里外不是人。你能做到公私分明，对方也未必能做到。 不论是 80 后还是 90 后，职场危机并非你人到中年时突然出现的，而是在你毕业两三年时就埋下了种子。 毕业后初入职场第一年，新入一个行业，一切都是新的，你充满好奇，充满干劲，充满希望，也满满的成就感，因为那是你从零到六七十分的过程，你每天都觉得自己在快速成长； 职场第二年，没有那么多好奇心了，但因为惯性，很多人还能保持学习，然而从 70 分以后的进步你就很难每天感受到了； 职场第三年，很多人没了好奇心，没了成就感，进步开始停滞，甚至怀疑自己，从此就是步入平庸的开始，也是职场危机的开始。 工作两三年后，要努力保护自己的好奇心，逼自己每天晚上睡觉的时候都要比昨天好一点点，哪怕仅是一点点。 进入新公司，做一个快递收发信息便利签。 写上公司详细地址、公司电话总机、自己的分机号码、自己邮箱地址，贴在显眼的位置，别等打电话的时候别人需要你还得找半天。 外出办事，要告知部门成员。 让大家可以联系到你，同时避免有人让你办事结果你没看到邮件、没做，最后发现你没在公司，事情也耽误了。 工作做完了、做好了，及时交代很重要。 工作没做完或者搞砸了，及时交代更重要。 工作中犯了错、有失误，立刻主动承认、解释。 别等别拖，哪怕是小错。上学时老师说的「我不想听你解释」，在职场中就是傻。 如果有同事突然跟你走得很近，你得保持一定的警惕，冷静分析对方有什么目的。 别得罪任何你不了解的人。 楼下保安、食堂阿姨、保洁叔叔，任何一个都可能就是你老板的亲戚朋友。 需要各位领导签字时，要按照顺序来，不要先找大领导再找小领导。 重要文件递交时，如果当事人不在，别放在桌上就走了，学会用信封和胶条。 重要文件，尤其涉及到数字的，要反复确认无误后再提交。 数字上少一个零、多一个小数点都可能会让公司付出沉重的代价。 职场是个利益场，不要老想靠着谁，人都是自私的，你只能靠自己。 良性职场人际关系的前提是，你对别人有价值。 别轻易说不会、不懂、不行，牛人都是在干中学、学中干，不断成长和进步的。 一开始不会没关系，但总说不会就没人再给你机会了，别老把自己当新人看。 不要背后议论同事。 预约，是起码的礼貌。 不要抱着电脑就突然站到同事背后，吓人一跳后说「我想请教你个问题」。预约是种意识，哪怕微信上招呼一下。 你把时间和精力投入在什么地方，你就会收获什么。 下班后过度消遣，你收获的就是空虚、焦虑、堕落；利用非工作时间学习，你收获的则是持续的进步、成功和喜悦。 如果你选对了公司，但入错了部门，应该优先申请转岗，而不是离职。 对公司来说也成立，好不容招到的人才，留下来肯定比外漏要好。 如果你想成为一个领导者，就不要等到真的升职后，才开始当领导。 不要管你现在的职位，要经常把握时机展示自己的领导力，否则你可能永远当不了领导。 老板或领导的决策总是会变来变去，不是因为他们 SB，而是这个时代的变化太快，市场变化太快，企业的应变速快必须跟上。 而且他们通常能比你更快的接受到更新、更重要的信息，他们有更多的时间进行更深入的思考、得出更优的结论。一个底层的逻辑，老板一定比你更在意结果和成败。 学会独立解决问题，敢于独立做决策，别不停的问问问。 老板眼中最理想的员工是，你只要告诉他你要什么、要什么效果就可以了。 工作经验不是指你一件事情做了多久，而是指，你用了多久的时间，去思考、优化、改善它。 很多时候我们的工作都是在靠惯性推动，不再去精进优化每一个环节，如果每天都能更严格一点，一天比一天好一点，你慢慢就能进化成这个岗位的顶尖高手。 要定期反思，我最近成长了多少。 别只到年底了才发现又荒废了一年，每个周末、月底多问自己「我成长了多少？」，别长期陷入麻木、重复、佛系的状态。 职场上只有功劳，没有苦劳。 苦劳就是无效劳动，一切没有产出的努力，都是在浪费资源。再能吃苦，创造不了价值，在公司眼里都等于零。","categories":[{"name":"工作经验","slug":"工作经验","permalink":"/categories/工作经验/"}],"tags":[{"name":"经验","slug":"经验","permalink":"/tags/经验/"}],"keywords":[{"name":"工作经验","slug":"工作经验","permalink":"/categories/工作经验/"}]},{"title":"⛄常考面试算法题类型总结☃","slug":"常考面试算法题类型总结","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T12:58:04.531Z","comments":true,"path":"2021/03/21/常考面试算法题类型总结/","link":"","permalink":"/2021/03/21/常考面试算法题类型总结/","excerpt":"","text":"注：本篇回答主要针对程序员校招求职。常考面试算法题类型总结结合2019春招和秋招真题，以下几类算法题最常考，汇总了一下：一、暴力枚举好多鱼！DNA合成连续整数序列和01翻转最长公共连续子串组装三角形最小的矩形字符串分类优美的回文串赶去公司调整队形集合涂棋盘小易记单词分饼干买帽子度度熊回家寻找三角形有趣的排序神奇数添加字符数组变换二、动态规划页码统计创造新世界双核处理堆砖块不等式数列牛牛的数列暗黑的字符串数字和为sum的方法数三、DFS/BFS推箱子工作安排幸运的袋子饥饿的小易跳石板地下迷宫四、数学超级素数幂找整除魔力手环混合颜料最大的奇约数末尾0的个数五、模拟实现平衡数消除重复元素奇怪的表达式求值变换次数六、贪心算法排序子序列组队竞赛训练部队七、字符串算法循环单词练习题库推荐推荐两个题库，面试算法题基本上都是从里面出的或者变形而来：1、剑指Offer2、leetcode在线编程算法视频推荐1、如何学习算法：十年算法刷题大牛手把手传授算法学习经验2、算法基础入门3、算法基础提升4、求职算法真题精讲-中级5、求职算法真题精讲-高级6、直通BAT算法精讲算法专栏推荐《程序员代码面试指南》左程云互联网名企面经精选因为每家公司的侧重点不同，所以他们面试时考的题目类型也不同。如果能提前知道每家公司考题的风格，临到自己上考场就会轻松很多。整理了一些前辈们的面试经验分享给大家：2020秋招面经大汇总！（岗位划分）笔经面经牛客网​www.nowcoder.com最后，祝大家都能拿到自己最想要的那份offer，加油~","categories":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}],"tags":[],"keywords":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}]},{"title":"⛄情侣之间聊什么话题能增进感情？☃","slug":"情侣之间聊什么话题能增进感情？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:04:30.609Z","comments":true,"path":"2021/03/21/情侣之间聊什么话题能增进感情？/","link":"","permalink":"/2021/03/21/情侣之间聊什么话题能增进感情？/","excerpt":"","text":"分享一些简单普适，可以随时拿来使用的话题叭（是像我这种话题杀手也能上手的(つД`)）~（更新在文末）我把列出的21个话题大致分为五类——回顾过去类、描述期望类、交换秘密类、兴趣爱好类、探讨未来类。每一类给出的话题举例不一定全面，但举一反三是没问题的，希望对你有用~（PS:话题不是用来生搬硬套的，直接拿来问人一堆问题，会像查户口似的，效果不太好。更适合的是在具体的「情境」下聊，而情境是可以自己创造的啦。）比如:①（一上来直接问）你印象最深刻的一个生日是怎么过的？（太突兀）②（铺垫情境）昨天我一个朋友（无中生友哈哈哈）过生日balabala（发生了什么趣事），我觉得这个生日对她来说肯定特别难忘了哈哈哈。哎那你呢，你印象最深刻的一个生日是怎么过的？（嗯至少会比上一种略好⑧）以下正文~♡♡♡♡♡♡♡♡关于增进感情，大致有两种情况，一种是刚在一起，需要建立感情基础，增进感情。一种是在一起一段时间后，平淡期增进感情。原文提到的五大类，相对更适用于前者，所以今天补充了一点更普适、更适用后者的话题，在文末。一、回顾过去类通过回顾过去的话题（可以是你们曾经一起做过的事情，也可以是对方之前的经历），既可以更多地了解对方之前的经历，也能通过一起回顾交往时的点点滴滴，增进彼此的感情。1.互相分享自己小时候的趣事与这个问题相关的一个小撩句子——“你嫁给我吧，以后让我妈妈给你讲。”ฅฅ*2.你印象最深刻的一个生日是怎么过的？3.刚认识的时候你对我的第一印象是怎样的？4.你是从什么时候开始喜欢我的？5.我做过的哪些事情让你很开心/难过/生气/失望？6.你还记得我们第一次去看的电影/吃饭的餐厅/接吻的情景/去过的地方吗？PS:关于回顾过去，好多小伙伴问说前任可以吗( 0 x 0 )，这个。。。前任最好不要经常提起。。这是一个让双方都不愉快的话题。回顾过去更主要、更好的是，双方一起经历过的过去。这样两个人都有参与感。♡♡♡♡♡♡♡♡二、描述期望类这种描述期望值类的话题，可以了解对方对于感情的期许，以及彼此的一些价值观、底线，知道了这些之后，在以后的生活中可以更好地磨合、相处。7.你喜欢我哪些方面？为什么？8.如果可以的话，你希望我能改掉哪些坏毛病？为什么？9.在一段感情当中，你觉得最重要的是什么/你最反感什么？10.你认为我们的感情对你来说重要程度怎样？♡♡♡♡♡♡♡♡三、交换秘密类这种话题相当于和彼此交换秘密，能够了解到一些对方不曾对很多人讲过的心事，也意味着你对ta来说越来越重要了。但是一定要注意分寸，面对对方实在不愿意讲的事情，也要给予尊重和理解。11.互相交换一个没有告诉过别人的秘密12.有没有哪些人或者哪些事是让你非常难忘的？13.你为什么这么喜欢/不喜欢xxx(人或事)？能告诉我原因吗？♡♡♡♡♡♡♡♡四、兴趣爱好类谈论兴趣爱好这类话题，或许听起来有些老套，但是如果你能了解并记住ta喜欢的不喜欢的事物，合适得当地选择生日礼物、挑选约会地点和项目；或者尊重、支持ta的一些小众喜好，相信在感情里这些都是加分项。14.你有哪些兴趣爱好？其中最喜欢的是什么？15.你喜欢玩游戏吗？最喜欢玩什么？16.你曾经最想收到的生日礼物是什么？17.你喜欢衬衣还是T恤？白色还是蓝色？18.你喜欢看书/看电影吗？喜欢看什么类型的？♡♡♡♡♡♡♡♡五、探讨未来类和对方一起探讨未来，如果把“你”“我”的表达换成“我们”会更好，把对方也规划到自己的未来里，实现的可能性也会变大噢。19.你以后想做什么职业？20.你最想去哪个城市生活？21.假期计划一起去哪里旅行？♡♡♡♡♡♡♡♡最后，不管选择聊什么话题，都要拒绝冷暴力，只有保持经常聊天，才能有效增进感情w~很开心最近这么多人来看这篇回答。但我还是想更一点最近的感受。最近陆陆续续看到这篇回答也有几千的收藏，评论私信也有一些，还是挺有感触的。大家在恋爱中都有或多或少的难处，但还是在思考着怎样聊天能增进感情，希望和对方再亲近一点，感情再好一点。我平时很少自己去想这些，但是这一点让我也挺触动的。我们这么多人经历着不太相同的感情，但都是同样地真心希望它能够长久安好。还有一点也挺让我触动的，就是我看到也有好些男孩子，用心想要去经营好这段感情，但是后来也有受伤难过。之前我一直觉得女孩子是比男孩子更细心、重感情的，而男孩子比较大大咧咧，感情只是生活的一小部分。现在才越来越觉得，其实在感情里我们都是一样的。用心去爱的人，不管男生还是女生，都是同样的在乎，同样的希望能够和对方长久，同样的会在感情里开心、难过。同时很开心也很感谢那些愿意和我分享自己感情故事的朋友们，或许我们并不相识，我能够实际帮到你们的也很少，但是至少我想让你知道，在感情经营这件事里，你并不孤单。感情有甜也有辛苦，希望大家都能前者大于后者。先就这些啦~想到再补充~对啦，还可以在这里找到我↓———————我是分割线———————更最近有不少小伙伴说以上话题都聊完了，不知道再聊什么。其实聊天不一定要针对某一个特别具体的话题来聊。找到一个比较普适的“套路”之后，话题是可以信手拈来的。而这个“套路”，在我看来就是有趣+新鲜+升华。首先有趣和新鲜的事物，我相信没有人不喜欢。比如我喜欢看热榜，聊八卦，看一些比较新鲜有趣，或者离奇不可思议的东西，也或者是一些小撩的句子套路或者表情包。那当我看到一个我觉得很有趣的内容，我就会把它截图或者复述给对方。不仅聊天话题有了，我相信在你发这些有趣新鲜内容的时候，在对方看来，其实你本人，也是有趣的。这样还给了自己一个不错的形象，何乐而不为呢？当然只有有趣还不够，这样一阵“哈哈哈”之后就没有后文了。还要给它“升华”。比如如果是一件事，在分享之余，就问问他的看法，谈谈彼此的看法，如果发生在自己身上会怎么处理。如果是小撩的句子或者表情包，也不能当做任务一样，发完就没有后文了。你就可以观察一下对方的反应，再借机继续撩一下。——————我是分割线——————一点小小的更新又想到一点别的，就是除了找具体的聊天话题之外，大家和对象也可以试试找一些小事情啊，小游戏啊一起做一起玩。因为最终目的是要增进感情嘛其实聊什么未必有那么重要，重要的是【一起】，聊天也是这样，可以增进感情是因为，此刻你们也是在【一起】和对方说说话啊这样至少能够感受到对方是在陪着你的。所以如果找不到聊天话题来【说】了，就可以找一些有趣好玩的小游戏之类的，一起【做/玩】呀~~互送礼物、注重仪式感，也可以增进感情噢～关于送女朋友的礼物，可以看看这里↓~","categories":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}],"tags":[],"keywords":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}]},{"title":"⛄有什么可爱到打滚的文案？☃","slug":"有什么可爱到打滚的文案？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:13:22.509Z","comments":true,"path":"2021/03/21/有什么可爱到打滚的文案？/","link":"","permalink":"/2021/03/21/有什么可爱到打滚的文案？/","excerpt":"","text":"1、喝酒吗，同归于尽的那种。2、希望大家对自己好一点，能怪对象的就别怪自己。3、别人吃炸鸡我也吃，别人喝奶茶我也喝，别人搞蛋糕我也搞，别人九十斤我不吭声。更多文案指引↓公众号：一只超级猪每日分享文案、壁纸、背景图、头像欢迎关注哟4、今天有点不开心，虽然不是你造成的，但是你能不能给我道个歉。5、去医院检查，医生一边写一边问：喝酒不？我一脸懵逼试探性的问：今晚吗？6、听说熬夜可以预防老年痴呆，因为根本活不到老年啊。7、小时候最讨厌的事情就是吃饭和睡觉，现在想想当年真是贱啊！8、如果有人问我，那些艰难的岁月是怎么熬过来的，我只有一句话回答，有一股强大的精神力量支撑着我叫“想死又不敢”。9、做人不要太攀比，要比就比谁早起。10、低头看看自己的肉，真是甩也甩不掉的温柔呢。11、今天用手机拍街景，以为拍到了迪丽热巴，后来才发现开的是前置摄像头。12、不开心的时候搞搞学习分分心，开心的时候搞搞学习助助兴。13、网吧里跟人起了冲突，我拿出一块键盘，现场打字骂他。14、上次舌吻的时候，还是小学夏天吃绿舌头的时候。15、你可以偷我的段子，也可以偷我的表情包，但你要是偷我的心，那我就要叫你宝贝了。16、爱情不是我生活的全部，打工才是。17、高价出售本人脑子，没有用过，有意者私。18、你不是真正的快乐，但我是。19、哪里有人喜欢孤独，其实就是没钱出去玩罢了。20、曾经小小少年，如今又大又圆。21、只要能用钱解决的问题，我一件都解决不了。22、发朋友圈不讲骚话让我讲什么？道德经吗。23、别愁眉苦脸的了，得不到我的男孩又不止你一个。24、怀疑宇宙悄悄拦截了有人爱我的信号。25、长得帅的叫学弟，长得漂亮的叫学妹，我叫新来的。26、没有什么困难是战胜不了我的。27、冰冻三尺非一日之寒，小腹三层非一日之馋！28、我啊，就一个平平凡凡的美女而已啦。29、贩卖可爱，一克一百块。30、日子很狗，但我不敢骂他，怕他疯狂咬我。31、会议内容只有一句“散会吧”是和我有关系的。32、最近圆了许多，我的可爱又多了一吨。33、我好喜欢小动物，比如炸鸡烤鸭水煮鱼。34、月亮奔你而来那还叫什么月亮，那叫陨石，来取你狗命的。35、有些男孩隔开七八公里外给我送宵夜，我想吃什么直接送到家门口我真的好感动…就是配送费贵了点。36、我哪里不好你告诉我，我马上把你删掉。37、关于我没有对象这件事，没有一个男人是无辜的。38、网课我真的听不进去，网恋我可以试试。39、生气归生气，又不是不喜欢你。40、运动是一种享受，但我不爱运动，因为我不是那种贪图享受的人。41、太累了，抽一名幸运网友为我扛下所有。42、过惯了没钱的生活，现在要开始过更加没钱的生活了。43、我喜欢的东西要么很贵，要么容易长胖，要么不回微信。44、掐指一算觉得你想我了。45、我的小愿望，晚上不失眠，卡上不缺钱。46、这辈子没什么野心，就想发个财而已。47、见你第一眼就知道，你是一个难养的猪。48、这都不点赞说明你手机不行。49、天下没有不散的宴席，但是如果你请客，我可以陪你多吃点。50、我怀孕了，孩子你的，孩子想喝奶茶想吃炸鸡，你听明白了吗。51、我觉得我挺会哄男孩子睡觉的，一句在吗他们就说要睡了。52、好看就是好看，难看就是难看，你说我好难看是什么意思？53、再凶的男孩子，绑鞋带还不是要绑蝴蝶结！54、一切都会变好的，比如从胖变成好胖。55、当我写作业想睡觉的时候，我就对自己说，这些都是奏折，是我的江山和子民，朕要做一代明君。56、其实我也参加了青春有你，但是易烊千玺说我不是选秀的料，是当他女朋友的料。57、 今晚月色真好，想吃麦辣鸡腿堡。58、在座的各位谁不是倾国倾城呢！59、傻瓜，有什么好道歉的呢，我又没打算原谅你。60、 如果你的女朋友太美，你怕她沾花惹草怎么办，换我也没用，我更美。61、有的人复习起来像孔子温故而知新，有的人复习起来像女娲补天，而我复习起来像哥伦布发现新大陆。62 、虽然我不会做饭，但我点的一手好外卖呀。63、我长得这么好看，主要谢谢我的父母，要不是他们给了我这个嘴，我也不会天天说。64、 悄悄熬夜成为地中海，然后闪瞎所有人。65、 原本我也可以是个渣女，都是害羞善良美丽听话懂事可爱专一有趣害了我。66、 不能给你摘天上的星星太阳月亮，只能给你捡捡地上的空瓶瓶来维持点生活了。67、 今天外面的风好大，我好害怕，万一别人都刮走了我刮不走，那多丢人。68、 好朋友失恋了，我也不知道怎么安慰她，只好把她拉黑了。69、 不笑运气差，一笑脸就大。70、 我也想恋爱的，父母不同意还是次要的，主要是我恋爱的人也不太同意。","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄收藏☃","slug":"收藏","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-23T09:56:26.292Z","comments":true,"path":"2021/03/21/收藏/","link":"","permalink":"/2021/03/21/收藏/","excerpt":"","text":"","categories":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}],"tags":[{"name":"收藏","slug":"收藏","permalink":"/tags/收藏/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}]},{"title":"⛄撩妹套路☃","slug":"撩妹套路","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:36:39.570Z","comments":true,"path":"2021/03/21/撩妹套路/","link":"","permalink":"/2021/03/21/撩妹套路/","excerpt":"","text":"谈恋爱真的很麻烦，所以以后就麻烦你了。 女生问你你为什么喜欢我？这个答案很长，需要用一生回答你。 别人用好看形容你，我用你形容好看 我怕你生孩子疼，才跟你闺蜜生的，你竟然说我不爱你？ 我说喜欢你 可是没说只喜欢你? 我很花心，喜欢上了每一个瞬间的你。?","categories":[{"name":"撩妹","slug":"撩妹","permalink":"/categories/撩妹/"}],"tags":[{"name":"套路","slug":"套路","permalink":"/tags/套路/"}],"keywords":[{"name":"撩妹","slug":"撩妹","permalink":"/categories/撩妹/"}]},{"title":"⛄有哪些个能让女朋友面膜掉下来的笑话？☃","slug":"有哪些个能让女朋友面膜掉下来的笑话？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:37:30.417Z","comments":true,"path":"2021/03/21/有哪些个能让女朋友面膜掉下来的笑话？/","link":"","permalink":"/2021/03/21/有哪些个能让女朋友面膜掉下来的笑话？/","excerpt":"","text":"001、有一匹野马，任何人都不能近身。➤传说这是一匹天马，凡人根本不配骑它。➤但只有一个意外，那就是你。➤因为这匹马的名字，叫小猪配骑。002、厨房年终总结大会，杯子首先发言：“这一年，我就是一个杯具。” ➤筷子想了想：“好像这里只有我拿得起，放得下。” ➤抹布跳出来骂道：“我擦！”003、鹦鹉和变色龙谈恋爱，有一天鹦鹉提出分手：“我妈不允许我们在一起。”➤变色龙惊讶道：“怎么了？你对你妈说啥了？”➤“我就照实说啊，我说我一靠近你你就会变色，我妈就说你是流氓，不能相信。”004、小马背着粮食要过河。牛伯伯说：“没事儿的，这水很浅，才刚到我的小腿。”➤小马刚要过，小松鼠拦住他说：“不要啊不要啊，这水深得很，我有个朋友前两天就被卷走了。”➤小马考虑了一会儿，回头踢了牛伯伯一脚：“就你腿长！！！”005、三个强盗比谁的名气大。➤强盗甲：“我抢过一艘商船，上面有银两和姑娘，我可是有名的江洋大盗。”➤强盗乙：“我劫过一艘官船，上面有财宝和公主，我可是让人闻风丧胆的海盗。”➤强盗丙：“我只在小河上劫过一艘民船，上面有个老头和猪羊。。。”➤强盗甲、乙一脸不屑，强盗丙接着说：“我是。。。杂交水盗！”006、不知从什么时候开始，活得越来越不像自己了，像彭于晏老婆。007、谁认识刘德华或者刘德华的经纪人请联系一下我，我想让他用冷冷的冰雨在我脸上胡乱的拍一拍，谢谢，太TM热了！008、吾日三省吾身：到底是嫉妒使我丑陋，还是丑陋使我嫉妒？到底是贫穷使我孤僻，还是孤僻使我贫穷？到底是懒惰使我肥胖，还是肥胖使我懒惰？009、刚开着私家车出门，一小孩在我车前蹦来蹦去。➤我开口骂道：“哪里来的调皮蛋儿，你再乱蹦老子撞死你。”➤这娃说出的话真气人阿：“来呀来呀，来撞我啊。”➤我那个火蹭蹭就上来了：“你个小屁娃说话真不给自己留后路啊，要不是我这轮椅速度慢，我早TM开过去撞你了。”010、这人呐，真的不能随便乱发誓！➤我昨天跟他女朋友说：“我如果骗你，今天出门就让车撞死！”➤结果在家里缩了一天，根本不敢出去浪！011、女友跟我说，咱们分手吧。➤我说：好。➤她松了一口气，面带微笑：你终于肯放我走了。➤我叹了一口气，摇了摇头：都这么多年了，我也腻歪你了，早点走吧。➤说完，我把插在她头骨上的镇魂钉拔了出来。➤一阵风吹过，女友消失了。。。","categories":[{"name":"撩妹","slug":"撩妹","permalink":"/categories/撩妹/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"撩妹","slug":"撩妹","permalink":"/categories/撩妹/"}]},{"title":"⛄有什么是你追了很多女生都失败后才知道的？☃","slug":"有什么是你追了很多女生都失败后才知道的？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:09:01.618Z","comments":true,"path":"2021/03/21/有什么是你追了很多女生都失败后才知道的？/","link":"","permalink":"/2021/03/21/有什么是你追了很多女生都失败后才知道的？/","excerpt":"","text":"1、第一次不想做「好人」。2、平时多练俯卧撑。防止她需要你时，你扛不住。3、不要问刚认识的女生“有没有男朋友”？即使没有，也会告诉你有，问了等于白问。如果你真的想知道，时间和闺蜜会告诉你的。4、她可能会因你的跑车爱上你，但也可能会因别人的跑车比你贵，而抛弃你。5、不想谈都是借口，不喜欢才是真的。如果她跟你说恋爱没意思，不是她不想谈，只是不想和你谈。6、舔的越深，伤得越痛。一切无私奉献在不对的人面前，只能感动自己。7、女生很在意细节，多从小事关心她，你会有意外收获。就像看到好回答，愿意双击屏幕点赞的人，往往内心温柔细腻，大概率能遇到真爱~8、很多人不是怕恋爱失败，而是害怕失去后，没有更好的替代。9、一旦脱贫，脱单也会很容易。我曾经以为脱单比脱贫更重要，直到有一天我看到“再快的AE86，也追不上坐奔驰的夏树”时，我才恍然大悟，脱贫才是最快的脱单之道。10、朋友圈越漂亮的女生，越容易拒绝人。11、找对象，一定要看清对象。搞明白她为人怎么样？脾气怎么样？还有多少人和她在一起？不然很可能，你把她当真爱，她把你当小三。12、真正想娶的女生，是不会让她受伤的。有些人看到美女，盯着人家的身材看，还想追人家，说白了，你只是馋她身子。只有当你看到她，产生一种保护欲的时候，才是真爱。13、天天想着怎么谈恋爱，不如多提升自己。比如学学装扮、看看书、运运动……等你自身有了才华和魅力，美人缘自会来的。持续大量的阅读，不仅能提升认知，对情商的提高也是不容小觑的。这几年无论多忙，我都没放弃过读书，偷偷提一嘴，我现在的女友也是因初识时欣赏我的学识与谈吐，才开始关注我，最终走到一起的。如果你也想通过阅读改变气质，放大自身闪光点，可以关注我的公众号【铁木君】，我把这几年积攒的3000本高质量好书都分享给你，让你省下大量找书时间，快速提升自我，脱单也指日可待哟~14、不愿公开的感情，多半也会在藏着掖着中分手。15、女生极度需要安全感。不管去哪，下意识的保护好她，关键时刻给个抱抱，能让她感受到温暖和放松，绝对男友力爆棚~16、没做好准备前，千万别单独约喜欢的女生出来吃饭。万一她没啥话好说，你口才也不好，那可能是你和她的第一次也是最后一次约会。17、除了门当户对，两个人的层次也很重要。她坐着保时捷，你骑着小黄车接她下班。她喜欢全球到处走，你每天不是带她逛公园就是走绿道。她梦想成为大明星，举世瞩目，而你只想摆摊过个安稳日子。你想想，这日子过起来不吵架才怪。18、有时候，行动比甜言密语更管用。女生其实很好哄，比如生气的时候，送她个礼物，清空她的购物车，或者带她看场喜欢的电影等。比如，看到一篇喜欢的回答，行动上来个点赞收藏，比一百个口头支票更有用，还能防止丢失。19、恋爱多了你会发现，没追到前很正经，在一起后什么名场面都可能发生。20、美貌的基础是三观、人品。女神年轻再美，也会变老，真正能把幸福日子过下去的，不是一张深受你爱的脸，而是踏实、真诚、守信、爱你的好妻子。21、不要小看某些女生，真遇到分手、出轨这种事，分分钟比你还坚强。22、太久没结果的女生，不要追。不是把你当备胎了，就是把你当钱包。23、表白是最后的盖章，而不是你成功的原因。（接下条）24、两情相悦的表白是惊喜，不确定的当众表白是惊吓。如果还没有感觉到她特别喜欢你的地步，就当众表白，那你大概率会失败。你想想，大庭广众之下又不能轻易答应你，拒绝你又让双方难堪，最终思来想去，还是绝交吧。25、表白一次不成功，就不要轻易再来第二次。这个年代，大家都很爽快，如果拒绝你，只有3种情况：（1）表白来的太突然，对方一时无法做出决定，就拒绝了。（2）真的不喜欢你。（3）喜欢你但因为别的原因无法在一起。26、不管怎样，有技能的男生更有魅力。如果你会朗朗的钢琴、有周杰伦的作曲、抑或是朱自清的写作，只要一技之长都能让你更受欢迎。其中学会理财，也是必备技能之一。良好的理财习惯，能让物质根基更加牢固，使你和她的感情锦上添花。从17年到现在，我看了不少理财书籍和课程，还请教了很多擅于理财的大牛，对理财方面也有了一些经验见解，如果你是个月光族，又或总攒不住钱，可以关注我的公众号【铁木君】，我把花了大价钱寻得的理财秘诀，和一些自己的理财经验发给你，吸收内化后，希望能快速提升你对理财的认知，尽早给未来生活更多的保障。27、在不同的年龄，恋爱成本是不一样的。18岁谈恋爱，无需担心房子、资产，只要你有魅力，穷也可以接受。28岁谈恋爱，再多的花言巧语，都可能不如一张房本。28、帅和有钱，哪一个都可以。如果两个都有，那最好。29、太用力得来的感情，都不长久。因为真正想让你追到的人，是不舍得让你等太久的。30、眼缘很重要。心理学上的“首因效应”就说，第一眼印象会影响双方以后的关系发展；所以，去见喜欢的姑娘时，把自己收拾干净利落点，往往就能促成一段恋情。31、无论女孩嘴里多么喜欢你，在没有「实际」的行动前，都不要信。32、平等才是维系感情的基础。没有必要因身份地位低人一等，就在爱情里卑微苟活。心态放平的感情，才能走得更远。33、和女生聊天时学会倾听，学会赞赏和认同，会让你人缘更好。（不妨点个赞试试）34、一个人爱不爱你，可以从消息回复里看出来。如果你发了十几条，对方只回应一个字或表情，那估计是她对你不感兴趣。35、送礼物小秘诀：要送对方想要的，而不是送你想给的。你觉得好看的“死亡芭比粉”，她可能会放在抽屉里吃灰。36、越主动的女生，越要小心，特别是主动找你掏腰包的。说不定她不是喜欢你的人，而是你帅气的钱包。当然，并不是每个主动的女生都如此，有些主动是因为真的太爱你。37、如果你约女生出来，却发现她带上了闺蜜，不用惊讶。她只是和你不熟，或者想让闺蜜探探你的底子，看你靠不靠谱；遇到这种，好好表现就对了。38、约会不是查户口。不要一见面就问：“有没有房子车子、前任？”……这些问题只会让人反感。正确的姿势是：聊点生活，玩玩爱好，干点两个人都喜欢的事，让彼此的相处感到舒适。39、恋爱越级的关心总是做得越多，错的越多。在没确定关系前，不要老是去做男朋友才做的事情，换做你是她，也不想被打扰吧。40、不要为了单纯的欲望而交往。身心结合的爱情，才能持久。41、对你有意思的女生，不一定会主动，但一定可以从态度中表现出来。比如每次和你见面，总是化最美的妆，穿最特别的衣服。42、千万别怂，喜欢就追。不然远远看着喜欢的女生，连露面的机会都没有，这样你们在一起的概率几乎为零。喜欢就行动起来，故事通常都是从加好友开始的。43、最后，不管你谈过多少次恋爱，受过多少次伤，长得好看不好看，我都希望你能找到真爱，尽早脱单。特别是屏幕前看到一篇好的回答，愿意用手指点赞三连的你～","categories":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}],"tags":[],"keywords":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}]},{"title":"⛄有哪些你觉得是人间绝句的诗词？☃","slug":"有哪些你觉得是人间绝句的诗词？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:32:56.065Z","comments":true,"path":"2021/03/21/有哪些你觉得是人间绝句的诗词？/","link":"","permalink":"/2021/03/21/有哪些你觉得是人间绝句的诗词？/","excerpt":"","text":"苏轼&amp;李清照大大：人间绝句，没有我写不出的。1.且将新火试新茶，诗酒趁年华。——苏轼《望江南·超然台作》青春易逝，时不我待，若总顾影自怜，耽于消极，岂不任年华流走，空留遗憾。趁着风光正好，何不放目四海，游走天下，把握当下好时光，待回首时，只见快意潇洒。 2.惆怅东栏一株雪，人生看得几清明。——苏轼《东栏梨花》试想：苏轼曾惆怅地站在东栏旁，看着洁白的梨花，柳絮飘飞，落在他的身上，他感到自己也变成了“一株雪”，如此美景，他却突然慨叹，人生能有几回清醒明白的时候呢？以坦荡的胸怀面对人生的每一个瞬间，光风霁月，不为物障，回首往事方能无怨无悔。 3.但屈指西风几时来，又不道流年暗中偷换。——苏轼《洞仙歌·冰肌玉骨》屈指未成数，西风忽又来。迢迢疏星度河汉，流年不道暗偷换。须臾红颜成暮齿，美好的时光匆匆溜走，无暇回顾身后的风景。芸芸众生，似夸父，奋力追赶太阳的步伐，直至力竭，直至生命尽头。 4.浮名浮利，虚苦劳神。叹隙中驹，石中火，梦中身。——苏轼《行香子·述怀》人的一生只不过像快马驰过缝隙，像击石迸出一闪即灭的火花，像在梦境中的经历一样短暂。名利如浮云般变幻无常，为此汲汲营营不过劳神费力罢了。美好的时光应该送给美好的事物。5.酴釄落尽，犹赖有梨花。——李清照《转调满庭芳·芳草池塘》人事全非，花开花落皆有意。世间安得双全法，不负如来不负卿。 6.和羞走，倚门回首，却把青梅嗅。——李清照《点绛唇·蹴罢秋千》大概古今皆是如此，最开始的悸动，都似这般，未曾目触一个眼神，却已在心底泛起涟漪。 7.山中何事？松花酿酒，春水煎茶。——张可久《人月圆·山中书事》天下熙熙，皆为利来。我们就像是寄居蟹，涌入这冰冷的城市，住着不属于自己的房子，被人潮推搡着前进。却不知道，抛却名利，房前种花，屋后种菜的日子更令人欣喜，就像张可久那样，几间茅草屋，松花酿酒，春水煎茶足矣。8.世事漫随流水，算来一梦浮生。——李煜《乌夜啼·昨夜风兼雨》人世间的事情，如同流水东逝，说过去就过去了，想一想我这一生，就像做了一场大梦，以前的荣华富贵生活已一去不复返了。9.韶华不为少年留，恨悠悠，几时休。——秦观《江城子·西城杨柳弄春柔》光阴荏苒，岁月如梭，不知不觉我们的人生已走过了十多年。在这些年里，有人为前程拼搏，奋发学习，也有人终日靡靡，沉迷在游戏虚幻的欢乐中。但是时光如同单行道中的列车，只前进，不回头，“韶华不为少年留”。正因如此，在有限的时光里，只有我们不遗余力，挥洒汗水，才不枉韶华。 10.落花无言，人淡如菊。——司空图《诗品二十四则·典雅》落花无言是经过沧桑波折后的了然：成败宛如花一般，绚烂时是积蓄的必然，凋谢时亦是自然的选择。这是对人生起落的淡定和从容——落花无言而有言，人淡如菊心亦素。 11.且挨过三冬四夏，暂受些此痛苦，雪尽后再看梅花。——吴汝纶《百字铭》在吴汝纶的眼中，成功并不是春天随意飘落肩头的满树繁花，而是寒冬中迎着风雪一支独放的红梅。咬牙忍过三四年的严寒和酷暑，那一缕幽香才高洁傲立，更加楚楚动人。 12.草萤有耀终非火，荷露虽团岂是珠。——白居易《放言五首·其一》草丛间的萤虫闪耀，终究不是真火；荷叶上露珠晶莹，却也不是珍珠。脱离本质的形式终究只是假象。13.何时仗尔看南雪，我与梅花两白头。——徐珂《清稗类钞》拄着手杖，散步看南雪，我和梅花两个都是白头。梅花是因雪而白，我却是因愁而白。 14&amp;15.雨打梨花深闭门，忘了青春，误了青春。——唐寅《一剪梅·雨打梨花深闭门》流光容易把人抛，红了樱桃，绿了芭蕉。——蒋捷《一剪梅·舟过吴江》岁月无情，光阴易逝。【一剪梅这个词牌名可真棒ww 16.世情薄，人情恶，雨送黄昏花易落。——唐婉《钗头凤·世情薄》黄昏中下着雨，打落片片桃花，这凄凉的情景让人也不禁感伤。 17.两水夹明镜，双桥落彩虹。人烟寒橘柚，秋色老梧桐。——李白《秋登宣城谢朓北楼》句溪和宛溪夹城而流，缥青的溪水澄清如明镜。横跨两溪的凤凰桥和沂川桥在碧水夕阳的映照下宛若停落的彩虹。人家的一缕缕炊烟，使橘柚的深碧、梧桐的微黄色呈现出一片苍寒的颜色，秋色使梧桐树更显苍老。用比拟的手法显示秋景瑰丽变幻的色彩，写出秋景，更写出秋意。18.天可补，海可填，南山可移。日月既往，不可复追。——曾国藩那转瞬即逝、不可逆转的岁月留给每个人的时间都是一样的。而机遇往往只偏爱那些有准备的人，倘若不抓紧时间，充实自己，你便只能看着机会溜走，在余生的懊悔中惶惶度日。最后是来自张岱散文的句子，读完觉得自己在大自然修仙ing的那种句子ww19.林下漏月光，疏疏如残雪。——张岱《陶庵梦忆》从林叶中漏出的月光，稀稀疏疏，如同冬日的残雪。静谧的夜，清冷的月高高地俯视着大地，只有流浪在大地上的风不甘寂寞，偶尔发出声音惹人关注。层层叠叠的枝叶编就遮天的网，密密麻麻地铺在天空之下，月光从枝叶的缝隙间溜进来，零零点点地洒在地上，如同冬日落下的稀稀疏疏的残雪。 20.疏影横斜，远映西湖清浅；暗香浮动，长陪夜月黄昏。——张岱《补孤山种梅叙》这句话化用了林逋在《山园小梅》的诗句：“疏影横斜水清浅，暗香浮动月黄昏。”黄昏的月光为尘世披上一层朦胧的纱，梅花枝条嶙峋，稀疏的影子横斜在水面，愈发映衬得西湖清浅，若有若无的香气似在空气中浮动，好像不忍辜负黄昏月光。谢谢大家对纸条君的支持，为报大家的知遇之恩，纸条君又整理更新了20条，希望大家喜欢。21.醉后不知天在水，满船清梦压星河。 ——唐温如《题龙阳县青草湖》初读此句，只觉自己正置身在一幅绝美画卷中，黑夜如水，我撑着一帆小舟，飘荡在盈满闪光的河道上，那些是星星的倒影，随着碧波微微荡漾。我卧在船边，饮一壶清酒，飘飘然醉了，望着水中倒影，半梦半醒间还以为自己正卧在天河上。 22.肠断月明红豆蔻，月似当时，人似当时否？ ——纳兰性德《鬓云松令》欣赏一下整首诗：枕函香，花径漏。依约相逢，絮语黄昏后。时节薄寒人病酒，铲地梨花，彻夜东风瘦。掩银屏，垂翠袖。何处吹箫，脉脉情微逗。肠断月明红豆蔻，月似当时，人似当时否？希望永远也不懂，这诉不尽的情肠，忘不了的离殇。 23.醉过才知酒浓，爱过才知情重。你不能做我的诗，正如我不能做你的梦。 ——胡适《梦与诗》人喝过酒，才知道酒的淡浓，人相爱过，才知道这份爱的情重。我写的诗，只有我自己能懂，就像我永远也做不了你的梦…… 24.闲来静处，且将诗酒猖狂，唱一曲归来未晚，歌一调湖海茫茫。 ——沈复《浮生六记》荣华不过是晨曦的露珠，富贵不过是秋冬的白霜。沧海桑田，世事变迁，任他天潢贵胄；浮华宫殿，也都不过是一抔尘土。闲来静处，何不且将诗酒猖狂，唱一曲归来未晚，歌一调湖海茫茫？ 25.被酒莫惊春睡重，赌书消得泼茶香，当时只道是寻常。 ——纳兰容若的《浣溪沙》酒后小睡，春日好景正长，闺中赌赛，衣襟满带茶香，昔日平常往事，已不能如愿以偿。 26.衣带渐宽终不悔，为伊消得人憔悴。 ——柳永《蝶恋花》好想她啊，想到吃不下饭，日渐消瘦，衣带越来越宽松。但我不懊悔，容颜憔悴也甘之如饴。茶不思，饭不想，但心里还认命地默默期待，不正是每个坠入爱河里的人的写照吗？ 27.众里寻他千百度。蓦然回首,那人却在,灯火阑珊处。 ——辛弃疾《青玉案·元夕》华灯初上，街市上都是游人，到处笙箫齐鸣，彩灯飞舞。今夜的女子个个环佩叮当美若天仙，发间繁复缠绕着耀眼的珠翠。小心翼翼地找心上人，生怕一不小心就把她错过。可是走过一条又一条的大街，始终寻不到，心里一阵怅然。忽然，一个转身，她就在视野里不期而遇，殷殷之情，四目相对，一切期待尽在不言中。28.从前的日色变得慢，车，马，邮件都慢，一生只够爱一个人。 ——木心《从前慢》人们内心深处寻找纸上的温度。铺开信笺，笔尖留下温热的牵挂，等待邮戳把惦念寄到远方。单是这个过程，就足以让我们感动。29.玉楼金阙慵归去，且插梅花醉洛阳。 ——朱敦儒《鹧鸪天·西都作》这句话的意思是：就算是在华丽的天宫里做官，我也懒得去，只想插枝梅花，醉倒在花都洛阳城中。作者借这句话，是想说自己无意为官，鄙夷权贵，只愿醉心民间的生活。 30.燕子不归春事晚，一汀烟雨杏花寒。 ——戴叔伦《苏溪亭》燕子还没有回到旧窝，而美好的春光已快要完了，迷蒙的烟雨笼罩着一片沙洲，料峭春风中的杏花，也失去了晴日下艳丽的容光，显得凄楚可怜。 31.白头如新，倾盖如故。 ——邹阳《狱中上梁王书》小时候，纸条君看一本小说名为《传奇》，里面女主说了一句话：“若有来世，我定对别人白首如新，对你倾盖如故。”少时不懂其意，长大后才明白女主话中之意：别人于我如陌路，见君一眼已倾心。32.殷勤花下同携手，更尽杯中酒。 ——叶梦得《虞美人》花开有败，月圆又缺，散聚无常，生死未知。起起落落间，需要多么深重的缘分，才得遇一位知心爱人。生存所迫，少有闲时，却也不妨偶尔停下脚步，殷勤劝尽杯中酒。百年有限身，惜取眼前人。33.原来姹紫嫣红开遍，似这般都付与断井颓垣。 ——汤显祖《牡丹亭》繁花似锦的迷人春色，却无人赏识，只有破败的断井颓垣将这番美景收入眼中，恨就恨我游园太晚，如今春意即将逝去，不由得哀伤不已。34.绿杯红袖趁重阳，人情似故乡。 ——晏几道《阮郎归·天边金掌露成》羁旅之人，漫游于尘世，故乡成为心中的一轮明月，又逢重阳佳节，他们或举杯换盏，宴饮高歌；或月下独酌，静思往事。试问天地宽广，何处的人情能温厚似故乡？冯唐易老，李广难封，为求得生前身后名，我还要辗转到何方？35.客路那知岁序移，忽惊春到小桃枝。 ——赵鼎《鹧鸪天·建康上元作》故土沦亡，只有自己流踄异乡，时间轮转浑不知，忽见桃枝著花，才知春天到了。原来竟走了一季，故乡不知已在身后何方……36.人本过客来无处，休说故里在何方。随遇而安无不可，人间到处有花香。 ——林语堂《还珠格格》里的萧剑曾吟：以天为盖地为庐。这首诗也有异曲同工之妙，人本不知何方来，不必追问故乡地，随遇而安，以天为被，以地为炉，才是“斯真隐矣”。37.何事吟馀忽惆怅？村桥原树似吾乡。棠梨的落叶红好似胭脂般红艳的颜色,香气扑鼻的荞麦花洁白的如同雪一般。是什么让我在吟诗时突然觉得很惆怅，原来乡村的小桥原来像极了我的家乡!38.心静闲看物亦静，芭蕉过雨绿生凉。 ——齐白石画作《雨后》这是齐白石老人在他的画作《雨后》上的题词，配诗赏画，心情也会像雨后初晴一般宁静安和，清凉舒意。39.春光浓似酒，花故醉人，夜色澄如水，月来洗俗。 ——陈继儒的《小窗幽记》明媚多情的春光犹如自然精心酿制的浓酒，花开其中，惹得人醉意浓浓。夜色澄澈如水，温柔地洒在大地之上，站在光辉之间，一身尘俗都被洗净无存。好一派盎然春光！","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄有哪些句子，曾让你产生「我一辈子都写不出来」的想法？☃","slug":"有哪些句子，曾让你产生「我一辈子都写不出来」的想法？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:11:37.161Z","comments":true,"path":"2021/03/21/有哪些句子，曾让你产生「我一辈子都写不出来」的想法？/","link":"","permalink":"/2021/03/21/有哪些句子，曾让你产生「我一辈子都写不出来」的想法？/","excerpt":"","text":"1、且视他人之疑目如盏盏鬼火，大胆地去走你的夜路。——史铁生（我的座右铭）2、矮人看戏何曾见，都是随人说短长。——赵翼3、无法达成的目标才是我的目标，迂回曲折的路才是我想走的路，而每次的歇息，总是带来新的向往。——赫尔曼·黑塞4、如果想征服生命中的焦虑，活在当下，活在每一个呼吸里。——马特·海格5、于浩歌狂热之际中寒；于天上看见深渊。于一切眼中看见无所有；于无所希望中得救。——鲁迅6、愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光，就令萤火一般，也可以在黑暗里发一点光。不必等候炬火。此后如竟没有炬火：我便是唯一的光。——鲁迅（鲁迅先生的字句是我这辈子都写不出来的）7、借我一个暮年，借我碎片，借我瞻前与顾后，借我执拗如少年。——樊小纯写给木心的诗8、纵有千古，横有八荒；前途似海，来日方长。——梁启超9、我将融入剧烈争斗的大人世界，要在那里边孤军奋战必须变得比任何人都坚不可摧。——《海边的卡夫卡》10、月光还是少年的月光，九州一色还是李白的霜。——余光中《独白》11、酒入豪肠，七分酿成了月光。余下三分啸成剑气，绣口一吐，就半个盛唐。——余光中《寻李白》（余光中先生写的关于李白的字句真的瞬间击中我）12、知交零落实是人生常态，能够偶尔话起，而心中仍然温柔，就是好朋友。——三毛13、人生如逆旅，我亦是行人。——苏轼14、无论人生上到哪一层台阶，阶下有人在仰望你，阶上亦有人在俯视你。你抬头自卑，低头自得，唯有平视，才能看见真实的自己。——杨绛（每次为自己的失败感到迷茫的时候就会想起先生的这句话）15、我不要听到你嘴里的积极口号，不要看到你在受伤之后的眼泪。我要看到你平地一声雷的蛰伏，看到你特立独行却不被孤立的魅力，看到你与世无争却有迹可循的野心，看到你说堕落，却又不自甘堕落的自制力。16、为你，千千万万遍。——《追风筝的人》17、岁月不饶人，我亦未曾饶过岁月。——木心18、对未来真正的慷慨，是把一切献给现在。——加缪（高三时曾贴在桌角上鼓励自己）19、活在这珍贵的人间，太阳强烈，水波温柔。——海子20、应是天仙狂醉，乱把白云揉碎。——李白21、所谓无底深渊，下去，也是前程万里。——木心《素履之往》22、欲买桂花同载酒，终不似、少年游。——刘过《唐多令•芦叶满汀洲》23、上帝会扼住你的喉咙，但不会让你窒息。——森山洋24、大智不群，大善无帮，何惧孤步，何惧毁谤。——《文化苦旅》25、说是人生无常，却也是人生之常。——余光中26、瀑布的水逆流而上，蒲公英种子从远处飘回，聚成伞的模样，太阳从西边升起，落向东方。子弹退回枪膛，运动员回到起跑线上，我交回录取通知书，忘了十年寒窗。厨房里飘来饭菜的香， 你把我的卷子签好名字，关掉电视，帮我把书包背上。你还在我身旁。——戴畅《你还在我身旁》（央视做的一个广告，我的眼泪不值钱）27、谁终将声震人间，必长久深自缄默。谁终将点燃闪电，必长久如云漂泊。——尼采（别说原文了，就这翻译我都写不出来…）28、爱因斯坦生生将一座物理大山凿穿而得出一个哲学结论：当速度等于光速时，时间就停止；当质量足够大时，它周围的空间就弯曲。那么，我们为什么不可以再提出一个人格相对论呢？当人格的力量达到一定强度时，它就会迅如光速而追附万物，穹庐空间而护佑生灵。——梁衡29、我躺下是敦煌，醒来还是敦煌。——樊锦诗30、我要再和生活死磕几年。要么我就毁灭，要么我就注定铸就辉煌。如果有一天，你发现我在平庸面前低了头，就向我开炮。——杰克.凯鲁亚克《在路上》31、若逢新雪初霁，满月当空，下面平铺着皓影，上面流转着亮银，而你带笑地向我步来，月色与雪色之间，你是第三种绝色。——余光中《绝色》32、苟有恒，何必三更眠五更起。最无益，莫过一日曝十日寒。——胡居仁33、屋宇如鱼，匍匐在水面上，吐出日子，吐出生老病死和一个个连绵不绝的四季。——余秀华34、喜欢谈论痛苦的，往往是不识愁滋味的少年，而饱尝人间苦难的老年贝多芬，却唱起了欢乐颂。——周国平35、君臣一梦，今古空名。但远山长，云山乱，晓山青。——苏轼","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄网站☃","slug":"网站","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-29T11:57:16.798Z","comments":true,"path":"2021/03/21/网站/","link":"","permalink":"/2021/03/21/网站/","excerpt":"","text":"#技术类 ##github ##吾爱破解 ##中国红客联盟 ##OWASP ##脚本之家 ##CSDN ##码农 #视频类 ##B站 ##80S ##EDX #资源类 ##羽兔网 ##资源吧 ##ZD423软件分享 ##KK下载站 ##网盘搜索 ##语雀 #娱乐 ##对称画画 ##全历史 ##千亿像素看中国","categories":[{"name":"网站","slug":"网站","permalink":"/categories/网站/"}],"tags":[{"name":"网站","slug":"网站","permalink":"/tags/网站/"}],"keywords":[{"name":"网站","slug":"网站","permalink":"/categories/网站/"}]},{"title":"⛄李诞说过什么精辟的话？☃","slug":"李诞说过什么精辟的话？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:48:48.297Z","comments":true,"path":"2021/03/21/李诞说过什么精辟的话？/","link":"","permalink":"/2021/03/21/李诞说过什么精辟的话？/","excerpt":"","text":"1、日常生活中没什么可说但非得说点儿什么的时刻。2、没有朋友多孤独啊？ 有了也一样。3、我人生可以说是一帆风顺，没经历过什么挫折。 我活得这么丧，基本上是全靠自己的想象力。4、人生的真相是这样的：我敢骂政府，骂世界，骂他妈的上帝； 我毁佛谤祖，我睥睨天下， 但是我不敢骂楼上每个周末都在装修的邻居。5、大部分人都有一个经不起推敲的幻觉， 认为只要换换环境，自己的人生就会有起色。6、我的柔情，你永远不懂装懂。7、小北，我似乎从来没有过为了什么一定要怎么样的时候， 从来没有那么热烈过，即使是给你写的情书，也是压着手腕写。当然你很好，你这样理直气壮的很好，我喜欢你这样， 但是我不行，我就做你的退路好了。8、“师傅，被人激怒了怎么办？特别怒，忍不了的那种。”9、小北，每次见你都会惶恐，每次见你， 脑子里都是一句没头没尾的烂台——你从人群中走来。10、她：“我都不知道你今天走。”我：“那天喝酒没说啊？”她：“你吐得一塌糊涂。”我：“我次次都是一塌糊涂。”11、“师父，可我觉得淡泊名利很酷啊。”“你这是吃饱了。”12、小北，我咳嗽的时候，喝吐的时候，被鱼刺卡着的时候，有点难过的时候，你都要拍拍我的背，力度稍有不同，但都没什么用，是吧？但你总要做点什么，是吧？13、小李发现，人们不愿意相信简单的事儿， 似乎相信了简单的事儿，自己那点儿智商就被浪费了。14、开心点朋友们，人间不值得难过。15、小北，我很久不给你写情话了，我想，我是个普通人，怎么能那么爱你。16、今夜无雨，各地的晚风都如释重负。17、人生最重要的时刻就是你突然发现自己是错的那一刻， 就是你转变掉观点的那一刻。18、我喜欢人类，人类真的特别了不起，进化出了智力，但很多时候选择不用。很潇洒的物种。19、“结婚为什么要放爆竹啊？”“想必是给自己壮胆吧。”20、他吻我那天抽了红塔山，我到现在舌头上都是红塔山味儿。21、小北，我说我喜欢你，你说然后呢，我说和你在一起，你说然后呢，然后然后，哪儿有那么多的然后，然后就一起活着啊，不然怎么样。22、人生在世，你只要知道两件事。第一件是这世上绝对存在不需要读书也很聪明，不需要努力也过得很好，甚至不需要钱就能快乐的人。第二件就是那个人绝对不是你。23、想到，健身跑步，跟炼丹采药，追求的实在是一样的东西。24、你这点儿内心世界都丰富在脸上了。25、头疼，我一想到自己要做不想做的事，就会导致连想做的事都不想做了。26、都在健身，健身的人都颇自喜。27、王大爷说，自己在家炖肉，在快熟的时候，会听见炖肉说，孤孤独独，孤孤，独独。28、一切规律都是宇宙大王定下的，有重力是因为他需要把海水按在地上，有浮力是因为他认为鱼有资格飞行。29、小北，我想你，没有特别的花样，可说出来就显得很悲壮。30、我没有初心，我的初心就是想躺着，千万别跟我说勿忘初心，我正奋斗呢，你一劝，当场就躺下了。31、开心点吧朋友们，人间不值得。32、正是“要做有趣的人”这一追求的广为流传，使世界上多了好多无趣还很努力的人。33、人与人难以交流是怕熟知终会导致全面的乏味，人与人相爱是让人在活着时就能体验死亡。34、朋友说，我无端发笑的次数越来越多了。可我想念你的次数却没有减少。35、他们有许多关于爱的道理，我有你。36、未曾开言，我先笑场。笑场完了，听我诉一诉衷肠。37、人要多脆弱，才会宣告自己热爱某一样东西。38、土地，归于耕种的人；耕种的人，归于掌权的人；掌权的人，归于空虚。39、忍不了也要逼自己冷静，心里从一数到十，做二十个深呼吸，默诵大悲咒，回想生命里美好的东西，感觉自己的心态慢慢平和下来，然后再捅他比较准头。40、这世上能给人选的多数都是假象，其中最假的就是让人以为。41、天花板后面是星空，星空后面是我想象力受辱的地方，风中的人都自以为坚毅，却都缩着脖子。42、天青色等烟雨，而我在等你。点个关注在走哦~~~加更1、再互相憎恨的人,也得睡在同一个夜里。2、风中的人都自以为坚毅,却都缩着脖子。3、条条大路通罗马，可是我不想去罗马。4、佛祖能教你的道理，概率论都能教得更好。5、有天赋天赋就是个负担，没有天赋生命就是个负担啊。6、“没有朋友多孤独啊?”“有了也一样。”7、想到这已经是人类历史上最好的时代了，你是不是更绝望了。8、不明白你们遇到好事为什么要掐腿揉眼睛，真醒了怎么办?9、对于死去的人来说，死去的是我们。","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄程序员必须掌握哪些算法☃","slug":"程序员必须掌握哪些算法","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T12:51:25.323Z","comments":true,"path":"2021/03/21/程序员必须掌握哪些算法/","link":"","permalink":"/2021/03/21/程序员必须掌握哪些算法/","excerpt":"","text":"大学四年，算法是我非常注重学习的一门知识。下面是我觉得值得学习的一些算法以及数据结构，当然，并且我也整理一些看过不错的文章给大家，大家也可以留言区补充。如果觉得不错，别忘了点个赞哦。先上图，后详细解说 一、算法最最基础1、时间复杂度2、空间复杂度一般最先接触的就是时间复杂度和空间复杂度的学习了，这两个概念以及如何计算，是必须学的，也是必须最先学的，主要有最大复杂度、平均复杂度等，直接通过博客搜索学习即可。文章推荐：算法分析神器—时间复杂度 二、基础数据结构1、线性表列表（必学）链表（必学）跳跃表（知道原理，应用，最后自己实现一遍）并查集（建议结合刷题学习）不用说，链表、列表必须，不过重点是链表。三分钟基础数据结构：如何轻松手写链表？以后有面试官问你「跳跃表」，你就把这篇文章扔给他 2、栈与队列栈（必学）队列（必学）优先队列、堆（必学）多级反馈队列（原理与应用）特别是优先队列，再刷题的时候，还是经常用到的，队列与栈，是最基本的数据结构，必学。可以通过博客来学习。相关文章：三分钟基础知识：什么是栈？二叉堆是什么鬼？【算法与数据结构】堆排序是什么鬼？ 3、哈希表（必学）碰撞解决方法：开放定址法、链地址法、再次哈希法、建立公共溢出区（必学）布隆过滤器（原理与应用）哈希表相关的，推荐通过博客来学习，推荐文章：Hash冲突之开放地址法 4、树二叉树：各种遍历（递归与非递归）（必学）哈夫曼树与编码（原理与应用）AVL树（必学）B 树与 B+ 树（原理与应用）前缀树（原理与应用）红黑树（原理与应用）线段树（原理与应用）树相关是知识还是挺多的，建议看书，可以看《算法第四版》。相关文章：高频面试题：什么是B树？为啥文件索引要用B树而不用二叉查找树？【漫画】以后在有面试官问你AVL树，你就把这篇文章扔给他。腾讯面试题：有了二叉查找树、平衡树为啥还需要红黑树？【面试被虐】游戏中的敏感词过滤是如何实现的？ 5、数组树状数组矩阵（必学）树状数组其实我也没学过，，，， 三、各种常见算法1、十大排序算法简单排序：插入排序、选择排序、冒泡排序（必学）分治排序：快速排序、归并排序（必学，快速排序还要关注中轴的选取方式）分配排序：桶排序、基数排序树状排序：堆排序（必学）其他：计数排序（必学）、希尔排序对于十大算法的学习，假如你不大懂的话，那么我还是挺推荐你去看书的，因为看了书，你可能不仅仅知道这个算法怎么写，还能知道他是怎么来的。推荐书籍是《算法第四版》，这本书讲的很详细，而且配了很多图演示，还是挺好懂的。推荐文章：必学十大经典排序算法，看这篇就够了(附完整代码/动图/优质文章)(修订版) 2、图论算法图的表示：邻接矩阵和邻接表遍历算法：深度搜索和广度搜索(必学)最短路径算法：Floyd，Dijkstra（必学）最小生成树算法：Prim，Kruskal（必学）实际常用算法：关键路径、拓扑排序（原理与应用）二分图匹配：配对、匈牙利算法（原理与应用）拓展：中心性算法、社区发现算法（原理与应用）图还是比较难的，不过我觉得图涉及到的挺多算法都是挺实用的，例如最短路径的计算等，图相关的，我这里还是建议看书的，可以看《算法第四版》。漫画：什么是 “图”？（修订版）漫画：深度优先遍历 和 广度优先遍历漫画：图的 “最短路径” 问题漫画：Dijkstra 算法的优化漫画：图的 “多源” 最短路径 3、搜索与回溯算法贪心算法（必学）启发式搜索算法：A*寻路算法（了解）地图着色算法、N 皇后问题、最优加工顺序旅行商问题这方便的只是都是一些算法相关的，我觉得如果可以，都学一下。像贪心算法的思想，就必须学的了。建议通过刷题来学习，leetcode 直接专题刷。 4、动态规划树形DP：01背包问题线性DP：最长公共子序列、最长公共子串区间DP：矩阵最大值（和以及积）数位DP：数字游戏状态压缩DP：旅行商我觉得动态规划是最难的一个算法思想了，记得当初第一次接触动态规划的时候，是看01背包问题的，看了好久都不大懂，懵懵懂懂，后面懂了基本思想，可是做题下不了手，但是看的懂答案。一气之下，再leetcdoe专题连续刷了几十道，才掌握了动态规划的套路，也有了自己的一套模板。不过说实话，动态规划，是考的真他妈多，学习算法、刷题，一定要掌握。这里建议先了解动态规划是什么，之后 leetcode 专题刷，反正就一般上面这几种题型。后面有时间，我也写一下我学到的套路，有点类似于我之前写的递归那样，算是一种经验。也就是我做题时的模板，不过感觉得写七八个小时，，，，，有时间就写。之前写的递归文章：为什么你学不会递归？告别递归，谈谈我的一些经验 5、字符匹配算法正则表达式模式匹配：KMP、Boyer-Moore我写过两篇字符串匹配的文章，感觉还不错，看了这两篇文章，我觉得你就差不多懂 kmp 和 Boyer-Moore 了。字符串匹配Boyer-Moore算法：文本编辑器中的查找功能是如何实现的？ 6、流相关算法最大流：最短增广路、Dinic 算法最大流最小割：最大收益问题、方格取数问题最小费用最大流：最小费用路、消遣这方面的一些算法，我也只了解过一些，感兴趣的可以学习下。 总结对于上面设计到的算法，我都提供了感觉还不错的文章，建议大家收藏，然后可以利用零碎的时间进行阅读，有些人可能会觉得上面的算法太多，说实话，我觉得不多，特别是对于在校生的，上面涉及到的算法可以不用很懂，但至少得了解。至于书籍的话，如果你连基本数据结构都还不懂的，建议看《数据结构与算法》相关书籍，例如《大话数据结构》、《数据结构与算法分析》。如果你有一定的基础，例如知道链表，栈，队列，那么可以看《算法第四版》，不过这本书是用 Java 实现的，不过我觉得你只要学过 C，那么可以看的懂。这些算法的学习，虽然你觉得学了没有什么用，但还是那些话，它对你的影响是潜意识的，它可以给你打下很深厚的基础内功，如果你想走的更远，那么我推荐学习，标注必学的，那么我觉得，你是真的需要抽时间来学习下，标注原理与应用的，代表你可以不知道怎么用代码实现，但是必得知道它的实现原理以及应用，更多算法的学习，可以持续关注我的微信公众号『帅地玩编程』最后，我把自己的原创精华文章整理成了一本电子书，共 630页，无论你是要面试，还是提升自己的修为，我想它都一定能帮助你，否则找我要红包！目录如下 程序员内功修炼epub版：链接:https://pan.baidu.com/s/1WaCyiuEUv6dctOH6gaLbOg 密码:9svz 程序员内功修炼PDF版：链接:https://pan.baidu.com/s/1TDuD1rr1LTCMlWfSgVon7g 密码:4irm","categories":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}],"tags":[],"keywords":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}]},{"title":"⛄美句☃","slug":"美文","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T12:18:31.838Z","comments":true,"path":"2021/03/21/美文/","link":"","permalink":"/2021/03/21/美文/","excerpt":"","text":"不许人间见白头 何年离别泪似雨，化得此时雪如席。 情起月语风止处 你是四我也是四 我们在一起八[送心] 长安城内千书焚，只因未有先生文 你的酒窝没有酒，我却醉的像条狗。 海上月是天上月，眼前人是心上人。 恍见梨花染白头°绯雪沫菡 何来人间一惊鸿，只是世间一俗人。 我与春风皆过客，你携秋水揽星河。 人间朝暮 叶落惊秋 满堂花醉三千客 一剑霜寒十四州 不闻星河须臾固执走向你 秋江夜雨夜江秋，愁心孤灯孤心愁，落寞思绪思寞落，悠悠长夜长悠悠。 落霞与孤鹜齐飞 秋水共长天一色 忽有故人心头过，回首山河已是秋！ 一片赤胆平乱世，手握长枪定江山 锦瑟无端五十弦，一旋一柱思华年。 竹杖芒鞋轻似马，一蓑烟雨任平生 红酥手，黄藤酒，满城春色宫墙柳！ 应是天仙狂醉，乱把白云揉碎！ 青春本来就是马不停蹄的错过和相遇，愿我们各自发光，顶峰相见！ 你来时，携风带雨，我无处可避。你走时，乱了四季，我久病难医。是我太蠢了吗？虽然只是一瞬，竟想和你厮守一生。 既见君子，云胡不喜。 有趣的灵魂精神出轨，美丽的身体现实劈腿 还有365天就生日了，回想起上次生日仿佛就在今天 用了10年的qq号被盗，上来的密保问题“你的梦想是什么”，试了好多次都不对，后来恍然大悟，被盗的不是qq号，是梦想。 兴趣是你最好的老师，其次是耻辱。 说说：在13月 星期八 第25小时 第61分 或许你会是我的 普天之大，自识君，则为之君 平生不会相思，才会相思，便害相思 千秋无绝色，悦目是佳人。倾国倾城貌，惊为天下人。 愿得一人心，白首不相离 陌上花开，可缓缓归矣 两情若是久长时，又岂在朝朝暮暮 春水初生，春林初盛，春风十里，不如你 愿生活当下如水未来如诗，当然始终有你。 游戏只是一时上瘾，爱上你是一生沉迷。 100分和99分的区别在于卷子只有100分和只会99分 两斤桃花酿成酒 万杯不及你温柔 没有让人一见钟情的皮囊，也没有能让人日久生情的本领 远赴人间惊鸿宴，谈笑风声不动情。 今天是个没有流星也可以许愿的日子 思君不得夜难寐，错把流苏人间扬 云想衣裳花想容，春风拂过露华容 且将新火试新茶，诗酒趁年华 长街千堆雪 你来时冬至，但眉山风止，开口是“我来的稍稍迟”，大抵知心有庭树，亭亭一如你风致。 知心有庭树 林鹿兮兮 林深时见鹿，海蓝时见鲸，梦醒时见你。 青灯与酒 本是青灯不归客，但因浊酒留风尘。 慕溪 夜月醉君子/桃花舞佳人 夜恋桃一世/桃倾夜一世 也许我不好/最好的是你 炫耀你有我/羡慕你爱我 星星会发光/可乐会冒泡 心安即归处/相逢恐梦中 乘一笔春风/载一场春雨 迢迢间风月/去去隔烟霞 君心似我心/不负相思意 举身赴清池/自挂东南枝 夜临满江月/琐意绕重游 江边惊岁晚/白马过平川 一枕星河梦/缆星河入梦 与我坠星河/与你挽夜色 别梦是清欢/至味是春风 日曾明山川/月可照九州 长安有故里/故里归长安 城北亦无寒/城南花已开 情书写给山/眠意寄给秋 山川皆无恙/眉目不知秋 朝歌 青丝暮如雪 不许人间见白头 浮生若梦，为欢几何 满船清梦压星河 一枝梨花压海棠 远赴人间惊鸿燕，一睹人间盛世颜。我非人间惊鸿客，乃是人间一俗人。他日人间惊鸿舞，浮生人间皆如愿。愿有人间惊鸿落，笑看人间赴黄泉。 1。爱情这东西.始于颜值.陷于才华.忠于人品.痴于感觉.迷于肉体.最终折扣于物质.败于现实单身久了生人不敢开口，熟人不敢下手，没有了一见钟情的资本，更缺少日久生情的条件，躲得过对酒当歌的夜，躲不过四下无人的街，我期盼着一位富婆能看穿我的逞强，让我卸下伪装，带我走进她的心房 ，迈开腿，抓紧床再累也比打工强 2-对于昂贵而又贬值快的东西来说，最适合的投资方式是短租而不是购买3_我和玉米区别，玉米能让你吃到饱，我能陪你到老4_你知道么我有哮喘病，那为什么一看见你就呼吸急促心跳加速 1.时间会帮你攒够失望，并告诉你不用谢。 2.毕竟，一生很短，少有圆满。 3.我很平静的哭了，我曾认为我不爱你，可现在我才明白，为你哭了太多次，已经没有多余的泪水再去为你哭泣。 4.后来不懂爱的人慢慢懂了。懂爱旳人，却不敢再爱了。 5、别人的童话永远都是浪漫的，而我的童话却永远都是凄凉的。 6、越来越任性是因为爱得太深。越来越沉默是因为伤得太痛。越来越礼貌是因为失望透顶。 7、当每个人怀念曾最幸福的时候，那也是他最痛苦的时候。 8．失恋了一次，就好像明白了所有情歌的含义。 9．如果你开始想念我，记住，不是我自己要走，是你自己先松手。 你以为我刀枪不入，我以为你百毒不侵…… 你说，为我做的那么多，都与爱情无关。 12.那些我们所相信过的诺言，终于照旧成了一记耳光，啪的一声扇在了自己脸上。你始终都市是我的软肋，却永远都不会是我铠甲 1☞有房子 有车子 工资全给你 我只留200，我妈会游泳 难产保大人 余生请指教 姑娘2☞腿有链接么？3☞既然背影已赢了天下 为何还要转身乱了芳华4☞北冥有鱼，其名为鲲，鲲之大，一锅炖不下，化而为鸟，其名为鹏，鹏之大，需要两个烧烤架，一个秘制，一个麻辣，来瓶雪花，带你勇闯天涯。5☞自从玩了快手之后，磕的瓜子壳都不敢扔了，生怕有用6☞枯藤老树昏鸦，空调WiFi西瓜，葛优同款沙发，夕阳西下，我就往那一趴！7☞ 去医院做检查，医生拿着化验单说:“亏你来得及时.. 我长舒了一口气医生关切的说：再晚点停尸房可就没位置了 8☞ 我可能要红了！. 一包拆开的姨妈巾对另一包没拆开的姨妈巾说。9☞你把天空放大吧！我想看上帝😂😂10☞真羡慕那些揪着你的头发驰骋疆场的男人11☞看你了你视频，我总结了以下六点 ……12☞孙尚香沉稳之力，李白敏锐之力，大桥守护之力，诸葛掌控之力，苏烈坚韧之力，花千骨洪荒之力，宫本消弱之力，马化腾充钱之力，而我却无能为力。😂13☞看似稳中带皮，其实慌的一匹14☞ 一、以朋友的名义爱着一个人，连吃醋的资格都没有，有多喜欢，就有多心酸。 二、我要落落大方地放下你，才不枉疯疯癫癫地爱过你。 三、后来我才明白，人生中所有的念念不忘，所有的郁郁寡欢，所有忽如其来的沉默与叹息，微笑与眼泪，都来自这句话：如果是你就好了。 四、你权衡利弊，我及时止损。我们两个人做过最默契的一件事，大概就是一起退到陌生关系，从此再无瓜葛。 五、如果不是化了妆，下雨我都懒得打伞。如果不是为了生活，工作早就辞了。如果不是为了家人，活着都嫌麻烦。可惜没如果。 六、其实女人很敏锐，你爱不爱她，她一眼就能分辨出来，只不过有的装傻，有的自欺欺人，有的委曲求全，有的决定和你一起演。 七、好的爱情是花季的微风暖阳，为幸福润色增彩；错的爱情是花季的狂风暴雨，只会把幸福打得落花流水。 八、突然有点可怜自己，学习没学好，朋友没交好，没让父母过得好，喜欢的人留不住，也没有被坚定的选择过。 九、光活着就很难了，为什么还要我快乐。 十、舍不得又怎样，到最后还不是说散就散。 十一、其实也不是在挑什么，就是害怕好不容易找到的一个人，最后却还不如一个人。 十二、没必要让所有人都知道真实的你，也没必要跟别人不停地说，其实你是怎样的人，懂你的自然懂，这世上没有什么感同身受。 十三、这个世界充满假象，唯有痛苦从不说谎。 十四、一份感情若已沦落到分分合合的地步，那么之后的所有“合”都是为了找理由“分”。 十五、我又不是圣人，怎么会希望你过得很好，很幸福，我巴不得你过得贫穷孤独。每到深夜时，都是想着我的好。 十六、你喜欢谁谁就喜欢你这种事，电视剧都不敢这么演。 十七、以前耳朵馋，话和歌都贪婪，现在嘴巴怂，想爱却言不由衷。 十八、那些后来躺在黑名单的人。最开始也都是踩着七彩云朵而来，照亮过整个世界。 十九、随着年龄的增长，总会变得越来越宽容，很多事情到最后并不是真的解决了，而是算了吧。 二十、除了生离死别，所有的分开归根到底就是不够喜欢。所以，不过如此，不值一提。 二十一、爱情就像笑话，笑死了别人，笑疼了自己。 二十二、最可怕的恋爱对象：没房没车但有一颗爱你的心，感觉啥都没有还理直气壮，你不接受就是你太物质。 二十三、都说零度的水和冰放在一起都会融化，我怎么还敢期望我们的关系冷却了还会暖和起来。 二十四、好好生活，别爱而不得，别坠入爱河，别重蹈覆辙，别像从前。","categories":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}],"tags":[{"name":"美文","slug":"美文","permalink":"/tags/美文/"}],"keywords":[{"name":"美文","slug":"美文","permalink":"/categories/美文/"}]},{"title":"⛄视频☃","slug":"视频","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-23T10:06:01.407Z","comments":true,"path":"2021/03/21/视频/","link":"","permalink":"/2021/03/21/视频/","excerpt":"","text":"#那是的那四年","categories":[{"name":"资源","slug":"资源","permalink":"/categories/资源/"}],"tags":[{"name":"web","slug":"web","permalink":"/tags/web/"}],"keywords":[{"name":"资源","slug":"资源","permalink":"/categories/资源/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (10)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (10)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (10)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄谈恋爱都需要注意什么？☃","slug":"谈恋爱都需要注意什么？","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-25T13:02:31.481Z","comments":true,"path":"2021/03/21/谈恋爱都需要注意什么？/","link":"","permalink":"/2021/03/21/谈恋爱都需要注意什么？/","excerpt":"","text":"1.第一次跟男生约会，他带你去蹦床、蹦极、过山车等刺激运动，其实他在利用“吊桥效应”让你误以为心动，好好观察他这个人，别把暂时的心跳加快，当成喜欢上他的感觉。2.再喜欢一个人，倘若他无法给你未来的保证，也不愿意跟你计划明天，劝你趁早离开，这样的男人就是《三十而已》里的梁正贤，浪漫撩人但靠不住。3.谈恋爱，不要以为男人愿意为你花钱，就是真心爱你。有的人就不缺钱，用钱换爱是图省事。要看他最稀缺的点是否心甘情愿，比如，他很忙，愿意抽时间陪你；他父母反对，愿意抵抗一切，站你这边……4.恋爱里，多用些技巧+小心机，没毛病，也不丢人，恋爱书上的招数多学一学，温柔杀+星星眼+撒娇小作女，撩到心仪的男人是分分钟的事情。5.想要爱人，成为你希望他成为的人，最错误的方式是不断碎碎念的鞭策他，其实男人跟小孩一样，需要的是鼓励和夸奖。皮格马利翁效应告诉我们，潜移默化的期望、赞美，能让他慢慢变成你口中那样的人。6.不要给妈宝男、巨婴男伤害你的机会，在他犹豫听你的话，还是听妈妈的话时，你就该及时止损，因为成年人最该听的是自己的话。7.恋爱里一旦发现对方有撩骚、赌博、出轨、家暴等倾向，拒绝任何理由，坚决马上离开，杜绝后患。多看看社会新闻，恶魔往往就在身边。，8.恋爱也需要隐私和自留地，别刨根问底追问对方的前任或往事，除非你真的不在意。况且说多了，是不是在不断强化他的记忆，最终让本来淡忘的事成了念念不忘？9.谈恋爱，别暴露太多的需求感，别让他察觉你有多喜欢他，学会隐藏心意、收放自如。心理学上的延迟满足，既是对你，也是对他，否则开始太快，激情一没，感情立马凉凉。10.离开一个人最错误的方式是，不断强化痛苦，暗示失败。我们应该做的是，首先承认分手的事实，其次认定自己值得更好的人。心理学上的暗示效应~~你相信什么，你就会得到什么，失恋也自然成为美好生活的催化剂。11.一个男人总是在爱情中打击你、讽刺你、嘲笑你，然后间接证明这么糟糕的你，只有他能接受。毫无疑问，他是在PUA你，让你失去自信，再因为他建立自信，从而毫无原则的跟他在一起。12.恋人发生矛盾、争执很正常，但如果这个过程中，他不小心暴露了丑恶的面目，千万用手机拍下做记录，谈分手的时候拿出来看看，别心软，婚后他这种嘴脸只会变本加厉。13.男人有钱、多金、长得帅，如果这些优势跟你不发生关系，没有对你产生任何价值，增加你的隐形福利，那么，这样优质的男人跟你无缘，你跟他谈恋爱也只是“看起来很美”。14.爱情里会说话、能说话、说明白话很重要，也即是恋人之间的有效沟通。就算对方特别爱你，要是个闷葫芦、经常冷暴力你，妥妥的离开他，不然就是《三十而已》钟小琴和陈屿的下场。15.女生不要一吵架就说分手，人是有惯性的，说多了就跟“狼来了”一样，成了口头禅，要么对方不当回事，要么就是人家同意了，你却输不起，最终失去了爱情的主动权。16.在爱情里丁点都别委屈自己，即使他是有钱高帅富，他是温柔小奶狗，如果你们在一起并不快乐，都别往结婚上走，因为“开心、幸福”才是两个人结合的终极原因。17.谈恋爱，别一味付出当烂好人，要知道，对方有多喜欢你，取决于你本身有多大的魅力，能提供多少的奖赏，对他产生多大的价值。然后才是看你对待他好不好，你们合不合拍。千万别本末倒置，用付出换回的爱情说没就没。18.说了千百遍也不过时的真理是，女生千万别被爱情圈养，要有独立生存的能力，身边的爱情随时能昙花一现，手里的钞票才是最大的底气。19.别被爱情冲昏头脑，清楚自己的底线和框架在哪里，即使两个人当下感情很深，也不要随随便便丢掉原则。底线这种东西，一旦突破就是无下限，最终受伤害的是你自己。20.不要企图用婚姻来改变一个人，恋爱中的问题到了婚姻只会变本加厉。不要装聋作哑跟一个人走下去，结婚不是万能解药，伤口也不会不药而愈，真正的解药是换一个人重新开始。21.“神秘感”是爱情里的保鲜剂，让一个人慢慢发现你更多的好，对你做加法而不是减法，能让男生更珍惜你，觉得你是个宝藏girl。22.想要观察一个男生适不适合你，多和他约饭，他请你一顿，你请他一顿，有来有往。一是不欠他太多，二是借机观察他对你够不够照顾，饭相是不是有品，金钱有没有计较……食欲，能暴露一个人潜意识里的很多东西。23.恋爱里，不接受自己承受不起的礼物，避免对方过高期待你的回礼；也别赠送对方有负担的礼物，造成对方另有所图，或者压力山大，不要让感情开始就掺杂太多杂质。24.女生最最重要的是学会保护自己，杜绝两个字“失控”，无论是大脑失控，身体失控，还是局面失控，对于女生来说，受到的伤害远远大于男生。25.记住两件事：第一，人性经不起试探，别轻易测试你的另一半，结果会让你很失望；第二，人性经不起悖逆，不要让他在家庭和你之间做抉择，不要让他爱你胜过爱自己，因为他做不到。正确的做法是，顺从人性，接受现实，才更接近幸福。","categories":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}],"tags":[],"keywords":[{"name":"生活","slug":"生活","permalink":"/categories/生活/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (13)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (13)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (13)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (12)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (12)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (12)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (15)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (15)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (15)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (14)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (14)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (14)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (11)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (11)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (11)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (7)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (7)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (7)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (8)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (8)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (8)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本/","link":"","permalink":"/2021/03/21/转载 - 副本/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本 (9)","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本 (9)/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本 (9)/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄转载☃","slug":"转载","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载/","link":"","permalink":"/2021/03/21/转载/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄随想☃","slug":"随想","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:56:21.040Z","comments":true,"path":"2021/03/21/随想/","link":"","permalink":"/2021/03/21/随想/","excerpt":"","text":"","categories":[{"name":"随想","slug":"随想","permalink":"/categories/随想/"}],"tags":[{"name":"随想","slug":"随想","permalink":"/tags/随想/"}],"keywords":[{"name":"随想","slug":"随想","permalink":"/categories/随想/"}]},{"title":"⛄骂人金句☃","slug":"骂人金句","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-29T11:27:04.101Z","comments":true,"path":"2021/03/21/骂人金句/","link":"","permalink":"/2021/03/21/骂人金句/","excerpt":"","text":"我大祖安上下骂术五千年，形成了豪放派和婉约派两大派系。两大派系花开两朵各表一枝，各有各的特色，都是我祖安骂术顶梁之柱架梁之椽。吾辈婉约派骂术，讲究智取，直击要害于无形之间，绕过敌人的护甲沁入人心，从来不带脏字，却暗中把人祖宗十八代都关心了一遍，深深体现了婉约派的人文关怀。老子豪放派骂术，向来直爽，不注重那些弯弯绕，讲究一个气势，上来就问候别人家亲戚，或者直接和别人的亲人发生亲密接触，这种巨大的视觉和听觉冲击力让人防不胜防，豪放派的直来直去，充分体现了豪放派人质朴的人文关怀。如今，我祖安骂术蓬勃发展，早已闻名天下。并有专业子弟专门研究骂的技术，将其学术化，世人称之为骂学家。 1，两块钱的尺子都有20厘米，你有吗？ 2，家里户口本就一页吧 3，酸黄瓜，看爷一巴掌把你拍了。 4，撒把米放手机上，鸡的走位都比你强。 5，您说话真好听，小嘴跟抹了开塞露似的。 6，虽然你傻逼，但你在做你自己，我为感到开心。 7，我打了狂犬疫苗，你以为我会怕你。 8，小嘴跟抹了开塞露似的，老往外喷。 9，长得好看才叫海王，像你这种只能叫水鬼。 10，祝你和对象舌吻，永远拉丝。 11，如果不能说脏话，那我对你也无话可说。 12，你又在山海经的哪一页 13，你是亚里士多德的妹妹吧，珍妮玛氏多。 14，你好像肠胃不好，上厕所把脑袋拉出去了吧。 15，我喜欢的东西很俗，但确实能让我快乐，你也很俗，但你不是个东西。 16，答应我你不要在深夜里排位，不要让别的女人见识你的走位。 17，你比塑料袋还能装。 18，你没有对象，那应该攒了不少钱吧。 19，嘴巴那么毒，内心一定很苦吧。 20，真羡慕你一个人就能吃顿团圆饭。 21，你要是好看一点就不丑了。 22，有的人就是事儿多，粪车路过他家门口他都要拿勺子尝尝咸淡。 23，原来身残志坚就是您这个模样，受教了。 24，你说你是公主，问你在哪个KTV上班你又不说。 25，公主发脾气才叫公主病，你那叫什么，你那叫野鸡情绪失控综合症。 26，你好厉害，一定是自己长大的吧。 27，好看的女孩互相欣赏，丑陋的猪精才嫉妒。 28，我一般不说让人难堪的话，如果我说了那就是真的想要你难堪。 29，说真的，我挺羡慕你的皮肤的，你说你怎么能把它保养的那么厚呢。 30，你俩真般配，看来月老的垃圾分类挺到位的。 31，看你说话的逻辑，直肠通大脑吧 32，每次见到你都有一种感觉，这种感觉比我做噩梦的时候还要可怕。","categories":[{"name":"骂人套路","slug":"骂人套路","permalink":"/categories/骂人套路/"}],"tags":[{"name":"套路","slug":"套路","permalink":"/tags/套路/"}],"keywords":[{"name":"骂人套路","slug":"骂人套路","permalink":"/categories/骂人套路/"}]},{"title":"⛄转载☃","slug":"转载 - 副本 - 副本","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-24T07:57:58.316Z","comments":true,"path":"2021/03/21/转载 - 副本 - 副本/","link":"","permalink":"/2021/03/21/转载 - 副本 - 副本/","excerpt":"","text":"","categories":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}],"tags":[{"name":"转载","slug":"转载","permalink":"/tags/转载/"}],"keywords":[{"name":"转载","slug":"转载","permalink":"/categories/转载/"}]},{"title":"⛄花语☃","slug":"花语","date":"2021-03-20T16:13:14.000Z","updated":"2021-03-27T22:29:59.356Z","comments":true,"path":"2021/03/21/花语/","link":"","permalink":"/2021/03/21/花语/","excerpt":"","text":"1、芙蓉花的花语：纤细之美、贞操,纯洁美艳。&lt;img data-ratio=”0.6666666666666666” data-type=”jpeg” data-w=”500” height=”373” width=”500”data-src=”“ style=”margin-right: auto;margin-left: auto;vertical-align: middle;border-width: 0px;border-style: initial;border-color: initial;display: block;clear: both;opacity: 1;box-sizing: border-box !important;word-wrap: break-word !important;overflow-wrap: break-word !important;visibility: visible !important;width: auto !important;” /&gt;2、蝴蝶兰：我爱你3、牵牛花：爱情永固4、仙客来花语：喜迎贵客、好客5、时钟花：爱在你身边6、狗尾巴草：暗恋7、油桐花：情窦初开8、樱花：生命/等你回来(很浪漫的花)9、黑色曼陀罗：无间的爱和复仇，绝望的爱，不可预知的死亡和爱10、向日葵：沉默的爱11、蓝色妖姬或蓝玫瑰：相守是一种承诺，人世轮回中，怎样才能拥有一份温柔的情意！双枝蓝色妖姬花语：相遇是一种宿命，心灵的交汇让我们诉不尽的浪漫情怀。三枝蓝色妖姬，送花人表达的是另一种情愫-你是我最深的爱恋，希望永远铭记我们这段美丽的爱情故事！12、红蔷薇：热恋13、白蔷薇：纯洁的爱情14、黄蔷薇：永恒的微笑15、深红蔷薇：只想和你在一起16、粉蔷薇：爱的誓言17、粉红蔷薇：我要与你过一辈子18、圣诞蔷薇：追忆的爱情19、野蔷薇：浪漫的爱情20、水仙花：只爱自己21、仙人掌：坚硬坚强22、三叶草：一叶代表祈求，二叶代表希望，三叶代表爱情，四叶代表幸福(很幸运的草哦)23、彼岸花：悲伤的回忆/相互思念24、栀子花：永恒的爱/一生的守侯/我们的爱25、蔷薇：爱的思念26、蒲公英：无法停留的爱27、昙花：刹那的美丽，一瞬间永恒(昙花一现嘛)28、波斯菊：永远快乐29、卡萨布兰卡花(1)伟大的爱(2)一种充满回忆的花，花语是淡泊的永恒(3)易变的心(4)不要放弃一个你深爱着的人(5)死亡，一种盛开的很傲然，厌世的花(6)一种永恒的美(7)负担不起的爱，乍一看像普通百合吧？它是百合的一种，卡萨布兰卡的花蕊有种嗜血的感觉，相比没有普通百合的纯洁30、鸢尾：绝望的爱31、蓝色鸢尾：宿命中的游离和破碎的激情，精致的美丽，可是易碎且易逝…(很伤感呢)32、迷迭香：回忆不想忘记得过去，纪念33、龙舌兰：是为爱付出一切34、松虫草：寡妇的悲哀35、含羞草：自卑(我不这么认为，含蓄罢了)36、夜来香：在危险边缘寻乐37、非洲菊：永远快乐38、香槟玫瑰：我只钟情你一个/爱上你是我今生最大的幸福，想你是我最甜蜜的痛苦，和你在一起是我的骄傲，没有你的我就像一只迷失了航线的船。(经常用来送爱人，原来是因为这个花语)39、山樱花：纯洁/高尚/淡薄40、菖蒲：相信者的幸福41、百合：纯洁/神圣41、木棉花：珍惜眼前的幸福42、雏菊：隐藏爱情43、茉莉花：你是我的(像歌词一样啊)44、密蒙花：请幸福到来(原来这叫密蒙花，见到过呢)45、紫滕花：对你执着，最幸福的时刻46、蝴蝶花：相信就是幸福47、龙胆花：喜欢看忧伤时的你(霸气的名字)48、吀靨花：真诚不变的爱49、风信子：永远的怀念50、星辰花：永不变心51、爱丽丝：想你52、火百合：热烈的爱情(像极了卡萨布兰卡)53、紫玫瑰：珍惜的爱54、鳞托菊：永远的爱55、麦杆菊：永恒的记忆56、栀柳：依依不舍57、牵牛花：爱情永固58、黄玫瑰：褪色的爱59、白日菊：永失我爱60、野荨麻花：相爱61、丁香：回忆（也很喜欢这种花）62、紫云英：没有爱的期待63、红色天竺葵：你在我的脑海挥之不去64、粉红色天竺葵：很高兴能陪在你身边65、红色仙客：你真漂亮66、粉红色山茶花：是你的爱让我越变越美丽67、白色菊花：真实坦诚68、红色素菊或玫瑰：我爱你69、白色花束：把我的一切都奉献给你70、雪莲花：祈愿愿望达成后的安慰71、香水百合：纯洁，高贵72、白色铃兰：幸福即将到来（个人很喜欢的一种花，洁白，清脆的感觉）73、郁金香：热情的爱74、风铃草：温柔的爱(喜欢这个名字)75、百慕达奶油花：坚韧.顽强76、波斯菊：天天快乐77、圣诞花：美满冷漠，会受苦78、茶花：你值得敬慕79、杜鹃花：为了我保重你自己，温暖的，脆的，强烈的感情80、连翘：预料81、大岩酮：一见钟情高贵大方，有福气82、金鱼草：欺骗，高尚的女士，力量(远看很美的一种花)83、紫罗兰：感情的监禁，机敏，对我而言你永远那么美84、天竺葵：偶然的相遇85、薄荷：美德86、金凤花：智慧87、曼陀罗：不可欲知的死亡和爱(我非常喜欢的花，不漂亮，但就是奇异)88、紫色三色堇：有着紫色花瓣的三色堇，花语是‘沉默不语’，属性暗。89、黄色三色堇：有着黄色花瓣的三色堇，花语是‘忧喜参半’，属性土。90、彩叶草：绝望的恋情91、矢车菊：单身的幸福92、海芋：希望，雄壮之美93、情人草：完美爱情(寓意美好)94、银莲花：失去的希望95、小苍兰：纯洁、幸福、清新舒畅96、大理花：华丽、优雅（看起来很有设计感，有木有）97、翠菊：追想可靠的爱情、请相信我98、虞美人：安慰99、蓍草：安慰100、玉簪花：恬静！宽和","categories":[{"name":"花语","slug":"花语","permalink":"/categories/花语/"}],"tags":[],"keywords":[{"name":"花语","slug":"花语","permalink":"/categories/花语/"}]},{"title":"Hexo-Theme-Sakura","slug":"Hexo-Theme-Sakura","date":"2018-12-12T14:16:01.000Z","updated":"2021-03-23T09:24:50.060Z","comments":true,"path":"2018/12/12/Hexo-Theme-Sakura/","link":"","permalink":"/2018/12/12/Hexo-Theme-Sakura/","excerpt":"","text":"hexo-theme-sakura主题 English document 基于WordPress主题Sakura修改成Hexo的主题。 demo预览 正在开发中…… 交流群若你是使用者，加群QQ: 801511924 若你是创作者，加群QQ: 194472590 主题特性 首页大屏视频 首页随机封面 图片懒加载 valine评论 fancy-box相册 pjax支持，音乐不间断 aplayer音乐播放器 多级导航菜单（按现在大部分hexo主题来说，这也算是个特性了） 赞赏作者如果喜欢hexo-theme-sakura主题，可以考虑资助一下哦~非常感激！ paypal | Alipay 支付宝 | WeChat Pay 微信支付 未完善的使用教程那啥？老实说我目前也不是很有条理233333333~ 1、主题下载安装hexo-theme-sakura建议下载压缩包格式，因为除了主题内容还有些source的配置对新手来说比较太麻烦，直接下载解压就省去这些麻烦咯。 下载好后解压到博客根目录（不是主题目录哦，重复的选择替换）。接着在命令行（cmd、bash）运行npm i安装依赖。 2、主题配置博客根目录下的_config配置站点 # Site title: 你的站点名 subtitle: description: 站点简介 keywords: author: 作者名 language: zh-cn timezone: 部署 deploy: type: git repo: github: 你的github仓库地址 # coding: 你的coding仓库地址 branch: master 备份 （使用hexo b发布备份到远程仓库） backup: type: git message: backup my blog of https://honjun.github.io/ repository: # 你的github仓库地址,备份分支名 （建议新建backup分支） github: https://github.com/honjun/honjun.github.io.git,backup # coding: https://git.coding.net/hojun/hojun.git,backup 主题目录下的_config配置其中标明【改】的是需要修改部门，标明【选】是可改可不改，标明【非】是不用改的部分 # site name # 站点名 【改】 prefixName: さくら荘その siteName: hojun # favicon and site master avatar # 站点的favicon和头像 输入图片路径（下面的配置是都是cdn的相对路径，没有cdn请填写完整路径，建议使用jsdeliver搭建一个cdn啦，先去下载我的cdn替换下图片就行了，简单方便~）【改】 favicon: /images/favicon.ico avatar: /img/custom/avatar.jpg # 站点url 【改】 url: https://sakura.hojun.cn # 站点介绍（或者说是个人签名）【改】 description: Live your life with passion! With some drive! # 站点cdn，没有就为空 【改】 若是cdn为空，一些图片地址就要填完整地址了，比如之前avatar就要填https://cdn.jsdelivr.net/gh/honjun/cdn@1.6/img/custom/avatar.jpg cdn: https://cdn.jsdelivr.net/gh/honjun/cdn@1.6 # 开启pjax 【选】 pjax: 1 # 站点首页的公告信息 【改】 notice: hexo-Sakura主题已经开源，目前正在开发中... # 懒加载的加载中图片 【选】 lazyloadImg: https://cdn.jsdelivr.net/gh/honjun/cdn@1.6/img/loader/orange.progress-bar-stripe-loader.svg # 站点菜单配置 【选】 menus: 首页: { path: /, fa: fa-fort-awesome faa-shake } 归档: { path: /archives, fa: fa-archive faa-shake, submenus: { 技术: {path: /categories/技术/, fa: fa-code }, 生活: {path: /categories/生活/, fa: fa-file-text-o }, 资源: {path: /categories/资源/, fa: fa-cloud-download }, 随想: {path: /categories/随想/, fa: fa-commenting-o }, 转载: {path: /categories/转载/, fa: fa-book } } } 清单: { path: javascript:;, fa: fa-list-ul faa-vertical, submenus: { 书单: {path: /tags/悦读/, fa: fa-th-list faa-bounce }, 番组: {path: /bangumi/, fa: fa-film faa-vertical }, 歌单: {path: /music/, fa: fa-headphones }, 图集: {path: /tags/图集/, fa: fa-photo } } } 留言板: { path: /comment/, fa: fa-pencil-square-o faa-tada } 友人帐: { path: /links/, fa: fa-link faa-shake } 赞赏: { path: /donate/, fa: fa-heart faa-pulse } 关于: { path: /, fa: fa-leaf faa-wrench , submenus: { 我？: {path: /about/, fa: fa-meetup}, 主题: {path: /theme-sakura/, fa: iconfont icon-sakura }, Lab: {path: /lab/, fa: fa-cogs }, } } 客户端: { path: /client/, fa: fa-android faa-vertical } RSS: { path: /atom.xml, fa: fa-rss faa-pulse } # Home page sort type: -1: newer first，1: older first. 【非】 homePageSortType: -1 # Home page article shown number) 【非】 homeArticleShown: 10 # 背景图片 【选】 bgn: 8 # startdash面板 url, title, desc img 【改】 startdash: - {url: /theme-sakura/, title: Sakura, desc: 本站 hexo 主题, img: /img/startdash/sakura.md.png} - {url: http://space.bilibili.com/271849279, title: Bilibili, desc: 博主的b站视频, img: /img/startdash/bilibili.jpg} - {url: /, title: hojun的万事屋, desc: 技术服务, img: /img/startdash/wangshiwu.jpg} # your site build time or founded date # 你的站点建立日期 【改】 siteBuildingTime: 07/17/2018 # 社交按钮(social) url, img PC端配置 【改】 social: github: {url: http://github.com/honjun, img: /img/social/github.png} sina: {url: http://weibo.com/mashirozx?is_all=1, img: /img/social/sina.png} wangyiyun: {url: http://weibo.com/mashirozx?is_all=1, img: /img/social/wangyiyun.png} zhihu: {url: http://weibo.com/mashirozx?is_all=1, img: /img/social/zhihu.png} email: {url: http://weibo.com/mashirozx?is_all=1, img: /img/social/email.svg} wechat: {url: /#, qrcode: /img/custom/wechat.jpg, img: /img/social/wechat.png} # 社交按钮(msocial) url, img 移动端配置 【改】 msocial: github: {url: http://github.com/honjun, fa: fa-github, color: 333} weibo: {url: http://weibo.com/mashirozx?is_all=1, fa: fa-weibo, color: dd4b39} qq: {url: https://wpa.qq.com/msgrd?v=3&amp;uin=954655431&amp;site=qq&amp;menu=yes, fa: fa-qq, color: 25c6fe} # 赞赏二维码（其中wechatSQ是赞赏单页面的赞赏码图片）【改】 donate: alipay: /img/custom/donate/AliPayQR.jpg wechat: /img/custom/donate/WeChanQR.jpg wechatSQ: /img/custom/donate/WeChanSQ.jpg # 首页视频地址为https://cdn.jsdelivr.net/gh/honjun/hojun@1.2/Unbroken.mp4，配置如下 【改】 movies: url: https://cdn.jsdelivr.net/gh/honjun/hojun@1.2 # 多个视频用逗号隔开，随机获取。支持的格式目前已知MP4,Flv。其他的可以试下，不保证有用 name: Unbroken.mp4 # 左下角aplayer播放器配置 主要改id和server这两项，修改详见[aplayer文档] 【改】 aplayer: id: 2660651585 server: netease type: playlist fixed: true mini: false autoplay: false loop: all order: random preload: auto volume: 0.7 mutex: true # Valine评论配置【改】 valine: true v_appId: GyC3NzMvd0hT9Yyd2hYIC0MN-gzGzoHsz v_appKey: mgOpfzbkHYqU92CV4IDlAUHQ 分类页和标签页配置分类页 标签页 配置项在\\themes\\Sakura\\languages\\zh-cn.yml里。新增一个分类或标签最好加下哦，当然嫌麻烦可以直接使用一张默认图片（可以改主题或者直接把404图片替换下，征求下意见要不要给这个在配置文件中加个开关，可以issue或群里提出来），现在是没设置的话会使用那种倒立小狗404哦。 #category # 按分类名创建 技术: #中文标题 zh: 野生技术协会 # 英文标题 en: Geek – Only for Love # 封面图片 img: https://cdn.jsdelivr.net/gh/honjun/cdn@1.6/img/banner/coding.jpg 生活: zh: 生活 en: live img: https://cdn.jsdelivr.net/gh/honjun/cdn@1.6/img/banner/writing.jpg #tag # 标签名即是标题 悦读: # 封面图片 img: https://cdn.jsdelivr.net/gh/honjun/cdn@1.6/img/banner/reading.jpg 单页面封面配置如留言板页面页面，位于source下的comment下，打开index.md如下： --- title: comment date: 2018-12-20 23:13:48 keywords: 留言板 description: comments: true # 在这里配置单页面头部图片，自定义替换哦~ photos: https://cdn.jsdelivr.net/gh/honjun/cdn@1.4/img/banner/comment.jpg --- 单页面配置番组计划页 （请直接在下载后的文件中改，下面的添加了注释可能会有些影响） --- layout: bangumi title: bangumi comments: false date: 2019-02-10 21:32:48 keywords: description: bangumis: # 番组图片 - img: https://lain.bgm.tv/pic/cover/l/0e/1e/218971_2y351.jpg # 番组名 title: 朝花夕誓——于离别之朝束起约定之花 # 追番状态 （追番ing/已追完） status: 已追完 # 追番进度 progress: 100 # 番剧日文名称 jp: さよならの朝に約束の花をかざろう # 放送时间 time: 放送时间: 2018-02-24 SUN. # 番剧介绍 desc: 住在远离尘嚣的土地，一边将每天的事情编织成名为希比欧的布，一边静静生活的伊欧夫人民。在15岁左右外表就停止成长，拥有数百年寿命的他们，被称为“离别的一族”，并被视为活着的传说。没有双亲的伊欧夫少女玛奇亚，过着被伙伴包围的平稳日子，却总感觉“孤身一人”。他们的这种日常，一瞬间就崩溃消失。追求伊欧夫的长寿之血，梅萨蒂军乘坐着名为雷纳特的古代兽发动了进攻。在绝望与混乱之中，伊欧夫的第一美女蕾莉亚被梅萨蒂带走，而玛奇亚暗恋的少年克里姆也失踪了。玛奇亚虽然总算逃脱了，却失去了伙伴和归去之地……。 - img: https://lain.bgm.tv/pic/cover/l/0e/1e/218971_2y351.jpg title: 朝花夕誓——于离别之朝束起约定之花 status: 已追完 progress: 50 jp: さよならの朝に約束の花をかざろう time: 放送时间: 2018-02-24 SUN. desc: 住在远离尘嚣的土地，一边将每天的事情编织成名为希比欧的布，一边静静生活的伊欧夫人民。在15岁左右外表就停止成长，拥有数百年寿命的他们，被称为“离别的一族”，并被视为活着的传说。没有双亲的伊欧夫少女玛奇亚，过着被伙伴包围的平稳日子，却总感觉“孤身一人”。他们的这种日常，一瞬间就崩溃消失。追求伊欧夫的长寿之血，梅萨蒂军乘坐着名为雷纳特的古代兽发动了进攻。在绝望与混乱之中，伊欧夫的第一美女蕾莉亚被梅萨蒂带走，而玛奇亚暗恋的少年克里姆也失踪了。玛奇亚虽然总算逃脱了，却失去了伙伴和归去之地……。 --- 友链页 （请直接在下载后的文件中改，下面的添加了注释可能会有些影响） --- layout: links title: links # 创建日期，可以改下 date: 2018-12-19 23:11:06 # 图片上的标题，自定义修改 keywords: 友人帐 description: # true/false 开启/关闭评论 comments: true # 页面头部图片，自定义修改 photos: https://cdn.jsdelivr.net/gh/honjun/cdn@1.4/img/banner/links.jpg # 友链配置 links: # 类型分组 - group: 个人项目 # 类型简介 desc: 充分说明这家伙是条咸鱼 &lt; (￣︶￣)&gt; items: # 友链链接 - url: https://shino.cc/fgvf # 友链头像 img: https://cloud.moezx.cc/Picture/svg/landscape/fields.svg # 友链站点名 name: Google # 友链介绍 下面雷同 desc: Google 镜像 - url: https://shino.cc/fgvf img: https://cloud.moezx.cc/Picture/svg/landscape/fields.svg name: Google desc: Google 镜像 # 类型分组... - group: 小伙伴们 desc: 欢迎交换友链 ꉂ(ˊᗜˋ) items: - url: https://shino.cc/fgvf img: https://cloud.moezx.cc/Picture/svg/landscape/fields.svg name: Google desc: Google 镜像 - url: https://shino.cc/fgvf img: https://cloud.moezx.cc/Picture/svg/landscape/fields.svg name: Google desc: Google 镜像 --- 写文章配置主题集成了个人插件hexo-tag-bili和hexo-tag-fancybox_img。其中hexo-tag-bili用来在文章或单页面中插入B站外链视频，使用语法如下： {% bili video_id [page] %} 详细使用教程详见hexo-tag-bili。 hexo-tag-fancybox_img用来在文章或单页面中图片，使用语法如下： {% fb_img src [caption] %} 详细使用教程详见hexo-tag-fancybox_img 还有啥，一时想不起来……To be continued…","categories":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}],"tags":[{"name":"web","slug":"web","permalink":"/tags/web/"},{"name":"悦读","slug":"悦读","permalink":"/tags/悦读/"}],"keywords":[{"name":"技术","slug":"技术","permalink":"/categories/技术/"}]}]}